[
  {"term": "Iranian Plateau", "definition": "The elevated landmass stretching from the Zagros Mountains in the west to the Hindu Kush in the east, encompassing modern Iran, Afghanistan, and parts of Central Asia — the geographic cradle of Iranian civilization.", "section": "001", "sectionName": "Who Are the Iranians?"},
  {"term": "Iranshahr", "definition": "Literally 'the realm of Iran' or 'land of the Aryans'; the concept of Iran as a civilization-state with continuity across millennia, transcending any single dynasty or political system.", "section": "001", "sectionName": "Who Are the Iranians?"},
  {"term": "Indo-Iranian migration", "definition": "The movement of Indo-European-speaking peoples from the Central Asian steppe to the Iranian plateau and Indian subcontinent during the 2nd millennium BCE, giving rise to both Iranian and Indic civilizations.", "section": "001", "sectionName": "Who Are the Iranians?"},
  {"term": "Zoroastrianism", "definition": "The ancient Iranian religion founded by the prophet Zarathustra (Zoroaster), centered on the cosmic struggle between Ahura Mazda (truth/light) and Angra Mainyu (falsehood/darkness), and emphasizing Good Thoughts, Good Words, Good Deeds.", "section": "001", "sectionName": "Who Are the Iranians?"},
  {"term": "Avesta", "definition": "The primary sacred scripture of Zoroastrianism, composed in Old Avestan and Younger Avestan languages, containing the Gathas (hymns attributed to Zarathustra) and liturgical texts.", "section": "001", "sectionName": "Who Are the Iranians?"},
  {"term": "Shahnameh", "definition": "The 'Book of Kings' by Ferdowsi (completed c. 1010 CE), an epic poem of approximately 50,000 couplets recounting Iran's mythical and historical past from creation to the Arab conquest — the foundational text of Iranian national identity.", "section": "001", "sectionName": "Who Are the Iranians?"},
  {"term": "Arya / Airya", "definition": "The self-designation of the ancient Iranian peoples, meaning 'noble' or 'free'; the etymological root of 'Iran' (from Airyanam, 'land of the Aryans'). Distinct from the later racial misappropriation of the term.", "section": "001", "sectionName": "Who Are the Iranians?"},
  {"term": "Farsi (Persian)", "definition": "The dominant language of Iran, a member of the southwestern branch of the Iranian language family within Indo-European; evolved from Old Persian through Middle Persian (Pahlavi) to modern Farsi.", "section": "001", "sectionName": "Who Are the Iranians?"},
  {"term": "Azeri Turks", "definition": "Iran's largest ethnic minority (estimated 15-20% of population), concentrated in northwestern Iran (East and West Azerbaijan provinces), speaking a Turkic language while sharing in broader Iranian cultural identity.", "section": "001", "sectionName": "Who Are the Iranians?"},
  {"term": "Kurds", "definition": "An Iranian-speaking ethnic group (estimated 7-10% of Iran's population) concentrated in western Iran (Kurdistan, Kermanshah, Ilam provinces), with a distinct language, cultural traditions, and historical aspirations for autonomy.", "section": "001", "sectionName": "Who Are the Iranians?"},
  {"term": "Civilization-state", "definition": "A political entity whose legitimacy and identity derive from a continuous civilizational tradition rather than from modern nation-state criteria such as ethnic homogeneity or civic contract — a concept applied to Iran, China, and India.", "section": "001", "sectionName": "Who Are the Iranians?"},
  {"term": "Pahlavi (Middle Persian)", "definition": "The Middle Iranian language used during the Sassanid period (224-651 CE), written in a Semitic-derived script; the linguistic bridge between Old Persian and modern Farsi.", "section": "001", "sectionName": "Who Are the Iranians?"},
  {"term": "Shu'ubiyya", "definition": "A literary and cultural movement among non-Arab Muslims (especially Persians) during the 8th-10th centuries CE, asserting the cultural equality or superiority of non-Arab peoples against Arab-centric Islamic culture.", "section": "001", "sectionName": "Who Are the Iranians?"},

  {"term": "Dastgah", "definition": "The modal system of Persian classical music, consisting of twelve principal modes (seven dastgahs and five avazes), each with a distinct emotional character, melodic vocabulary, and repertoire of composed and improvised pieces.", "section": "002", "sectionName": "Persian Culture & Achievement"},
  {"term": "Radif", "definition": "The canonical repertoire of Persian classical music — a collection of approximately 250-300 melodic pieces (gushehs) organized within the dastgah system, transmitted orally from master to student and serving as the foundation for performance and improvisation.", "section": "002", "sectionName": "Persian Culture & Achievement"},
  {"term": "Miniature painting", "definition": "The Persian tradition of detailed, small-scale painting used to illustrate manuscripts, characterized by vivid color, flat perspective, elaborate detail, and symbolic composition — reaching its peak under the Timurid and Safavid dynasties.", "section": "002", "sectionName": "Persian Culture & Achievement"},
  {"term": "Ghazal", "definition": "A poetic form of couplets (typically 5-15) sharing a rhyme scheme and refrain, used extensively in Persian poetry for themes of love, mysticism, and philosophical reflection. Mastered by Hafez and Saadi.", "section": "002", "sectionName": "Persian Culture & Achievement"},
  {"term": "Masnavi", "definition": "A poetic form using rhyming couplets, employed for narrative and didactic poetry. Rumi's Masnavi-ye Ma'navi (Spiritual Couplets), at approximately 25,000 verses, is the most celebrated example.", "section": "002", "sectionName": "Persian Culture & Achievement"},
  {"term": "Chahar Bagh", "definition": "Literally 'four gardens'; the classic Persian garden design dividing the space into four quadrants with water channels, representing the four rivers of paradise — the template for garden design from the Alhambra to the Taj Mahal.", "section": "002", "sectionName": "Persian Culture & Achievement"},
  {"term": "Illuminationism (Ishraq)", "definition": "The philosophical school founded by Suhrawardi (1154-1191) synthesizing Platonic, Zoroastrian, and Islamic thought, positing light as the fundamental metaphysical principle and developing a sophisticated epistemology of intuitive knowledge.", "section": "002", "sectionName": "Persian Culture & Achievement"},
  {"term": "Transcendent Theosophy (al-Hikma al-Muta'aliya)", "definition": "The philosophical system of Mulla Sadra (1571-1640) synthesizing Peripatetic, Illuminationist, and mystical traditions, centered on the primacy of existence (asalat al-wujud) and the substantial motion of being.", "section": "002", "sectionName": "Persian Culture & Achievement"},
  {"term": "Arabesque", "definition": "The intricate geometric and vegetal ornamentation characteristic of Islamic and Persian art, based on mathematical patterns of repetition and symmetry, used extensively in architecture, tile work, and manuscript illumination.", "section": "002", "sectionName": "Persian Culture & Achievement"},
  {"term": "Kashi (tile work)", "definition": "The art of decorative glazed tile work in Iranian architecture, using techniques including mosaic (muarraq), underglaze painted, and haft-rang (seven-color) methods — a signature element of Iranian mosques, palaces, and public buildings.", "section": "002", "sectionName": "Persian Culture & Achievement"},
  {"term": "Al-Khwarizmi", "definition": "Muhammad ibn Musa al-Khwarizmi (c. 780-850 CE), Persian mathematician and astronomer whose Kitab al-Jabr gave the world the word 'algebra' and whose name gave us the word 'algorithm' — one of the most influential scientists in history.", "section": "002", "sectionName": "Persian Culture & Achievement"},
  {"term": "Ruba'i (quatrain)", "definition": "A four-line poetic form with the rhyme scheme AABA, immortalized by Omar Khayyam and made famous in the West through Edward FitzGerald's translation of the Rubaiyat (1859).", "section": "002", "sectionName": "Persian Culture & Achievement"},
  {"term": "Ta'zieh", "definition": "A form of Shia religious dramatic performance commemorating the martyrdom of Imam Hussein at Karbala — the only indigenous dramatic tradition in the Islamic world, blending ritual, theater, and communal mourning.", "section": "002", "sectionName": "Persian Culture & Achievement"},

  {"term": "Ta'arof", "definition": "The elaborate Iranian system of courtesy, ritual politeness, and social negotiation governing interactions from commercial transactions to personal relationships — a codified system of deference, generosity displays, and social navigation far more complex than Western 'politeness.'", "section": "003", "sectionName": "The Iranian Spirit"},
  {"term": "Taqiyya", "definition": "The practice of concealing one's true beliefs or intentions to avoid persecution, theologically sanctioned in Shia Islam and practiced broadly in Iranian culture as a survival mechanism under hostile authorities — from the Umayyad caliphate to the modern surveillance state.", "section": "003", "sectionName": "The Iranian Spirit"},
  {"term": "Khanevadeh", "definition": "The Iranian family unit — extended, hierarchical, and functioning as the primary institution of loyalty, economic cooperation, social security, and identity transmission in Iranian society.", "section": "003", "sectionName": "The Iranian Spirit"},
  {"term": "Bazaar (bazar)", "definition": "The traditional Iranian marketplace, functioning simultaneously as an economic system, social institution, information network, and political force — historically the site where merchant capital, clerical authority, and popular sentiment converge.", "section": "003", "sectionName": "The Iranian Spirit"},
  {"term": "Zerangi", "definition": "Literally 'cleverness' or 'shrewdness'; the valued Iranian quality of navigating complex social and political situations through wit, strategic ambiguity, and adaptive flexibility — distinct from dishonesty, though sometimes overlapping.", "section": "003", "sectionName": "The Iranian Spirit"},
  {"term": "Rouye khosh", "definition": "Literally 'good face'; the Iranian practice of maintaining a pleasant, agreeable exterior regardless of inner feelings — related to ta'arof but specifically about the management of emotional expression in social contexts.", "section": "003", "sectionName": "The Iranian Spirit"},
  {"term": "Shahid (martyr)", "definition": "In Shia Islam, one who dies bearing witness to faith and justice — a concept central to the Karbala narrative that has been applied throughout Iranian history from Imam Hussein to the Iran-Iraq War to the 2022 protest movement.", "section": "003", "sectionName": "The Iranian Spirit"},
  {"term": "Karbala paradigm", "definition": "The narrative framework drawn from Imam Hussein's martyrdom at Karbala (680 CE), which structures Shia and Iranian political consciousness around the themes of righteous resistance against unjust power, willingness to sacrifice, and the ultimate triumph of justice.", "section": "003", "sectionName": "The Iranian Spirit"},
  {"term": "Zaher/Baten", "definition": "The outer/inner or exoteric/esoteric distinction fundamental to Iranian culture — the recognition that reality operates on multiple levels, that surfaces conceal depths, and that truth often requires looking beyond appearances.", "section": "003", "sectionName": "The Iranian Spirit"},
  {"term": "Erfan", "definition": "Islamic mysticism as practiced in the Iranian tradition (related to but distinct from Sufism), emphasizing direct experiential knowledge of the divine, inner transformation, and the inadequacy of purely legalistic religion.", "section": "003", "sectionName": "The Iranian Spirit"},
  {"term": "Iranian exceptionalism", "definition": "The belief — held to varying degrees — that Iran's civilizational continuity, cultural achievements, and historical resilience make it fundamentally unique among nations. A concept requiring critical examination for both its factual bases and its mythological embellishments.", "section": "003", "sectionName": "The Iranian Spirit"},
  {"term": "Mehmani", "definition": "The Iranian tradition of hospitality and hosting — an elaborate social institution with codified expectations around generosity, food abundance, guest treatment, and reciprocal obligation that functions as social bonding and status display.", "section": "003", "sectionName": "The Iranian Spirit"},
  {"term": "Dual identity", "definition": "The coexistence within Iranian culture of two sometimes complementary, sometimes competing identity frameworks: the pre-Islamic Iranian civilizational identity and the Islamic (specifically Shia) religious identity.", "section": "003", "sectionName": "The Iranian Spirit"},

  {"term": "Achaemenid Empire", "definition": "The first Persian Empire (c. 550-330 BCE), founded by Cyrus the Great, spanning from the Balkans to the Indus Valley at its peak — the largest empire the world had seen, governing through a sophisticated system of satrapies and tolerant rule.", "section": "004", "sectionName": "Ancient Iran"},
  {"term": "Satrapy", "definition": "An administrative province of the Achaemenid Empire, governed by a satrap (governor) who collected taxes, maintained order, and commanded local military forces while answering to the Great King — a model of imperial administration influential for subsequent empires.", "section": "004", "sectionName": "Ancient Iran"},
  {"term": "Cyrus Cylinder", "definition": "A clay cylinder inscribed with a declaration by Cyrus the Great (c. 539 BCE) following his conquest of Babylon, describing his policies of religious tolerance and return of displaced peoples. Often called the 'first declaration of human rights,' though scholars debate this characterization.", "section": "004", "sectionName": "Ancient Iran"},
  {"term": "Behistun Inscription", "definition": "A multilingual (Old Persian, Elamite, Babylonian) rock inscription carved by Darius I (c. 520 BCE) on a cliff face in western Iran, narrating his rise to power and serving as the key document for deciphering cuneiform script — the 'Rosetta Stone' of the ancient Near East.", "section": "004", "sectionName": "Ancient Iran"},
  {"term": "Parthian (Arsacid) Empire", "definition": "The second great Iranian empire (c. 247 BCE-224 CE), founded by Arsaces I, notable for its feudal-decentralized political structure, Hellenistic cultural synthesis, military innovation (heavy cavalry and the 'Parthian shot'), and successful resistance to Roman expansion.", "section": "004", "sectionName": "Ancient Iran"},
  {"term": "Sassanid Empire", "definition": "The last pre-Islamic Iranian empire (224-651 CE), founded by Ardashir I, characterized by centralized administration, Zoroastrianism as state religion, and rivalry with Rome/Byzantium — often considered the peak of pre-Islamic Iranian civilization.", "section": "004", "sectionName": "Ancient Iran"},
  {"term": "Elamites", "definition": "A non-Iranian civilization centered on Susa in southwestern Iran (c. 3200-539 BCE), with its own language, script, and culture — one of the earliest urban civilizations and a significant precursor to Iranian civilization on the plateau.", "section": "004", "sectionName": "Ancient Iran"},
  {"term": "Medes", "definition": "An Iranian people who established the first Iranian political entity (the Median Empire, c. 678-549 BCE) in western Iran, known primarily from Assyrian records and Herodotus — their extent and organization remain subjects of scholarly debate.", "section": "004", "sectionName": "Ancient Iran"},
  {"term": "Farr (khvarenah)", "definition": "The divine glory or royal charisma in Zoroastrian tradition that legitimized kingship — the belief that the rightful king possessed a sacred quality bestowed by Ahura Mazda, which could be lost through injustice or impiety.", "section": "004", "sectionName": "Ancient Iran"},
  {"term": "Shahanshah", "definition": "'King of Kings' — the title used by Achaemenid, Parthian, and Sassanid rulers, reflecting the Iranian model of universal sovereignty over a multi-ethnic empire of subordinate kingdoms.", "section": "004", "sectionName": "Ancient Iran"},
  {"term": "Royal Road", "definition": "The Achaemenid highway system spanning approximately 2,700 km from Susa to Sardis, with relay stations enabling mounted couriers to traverse the empire in 7-9 days — an engineering achievement that facilitated imperial communication and trade.", "section": "004", "sectionName": "Ancient Iran"},
  {"term": "Ctesiphon", "definition": "The Parthian and Sassanid capital on the Tigris River (near modern Baghdad), home to the Taq-e Kisra — the great vaulted iwan whose ruins remain the largest single-span vault of the ancient world.", "section": "004", "sectionName": "Ancient Iran"},
  {"term": "Parthian shot", "definition": "The cavalry tactic of turning backward in the saddle to shoot arrows while retreating at full gallop — a Parthian military innovation that became legendary after the Battle of Carrhae (53 BCE) and entered English as a metaphor for a parting attack.", "section": "004", "sectionName": "Ancient Iran"},
  {"term": "Zoroastrian state religion", "definition": "The Sassanid institution of Zoroastrianism as the official religion with a formal clerical hierarchy (magi), orthodoxy enforcement, and close integration of religious and political authority — a model that influenced the later Islamic Republic's fusion of religion and state.", "section": "004", "sectionName": "Ancient Iran"},

  {"term": "Battle of Qadisiyyah (636 CE)", "definition": "The decisive Arab-Muslim victory over the Sassanid army in southern Iraq, opening Iran to conquest. Later appropriated by Saddam Hussein as propaganda during the Iran-Iraq War ('Saddam's Qadisiyyah'), making it a deeply politicized historical reference.", "section": "005", "sectionName": "Islamic Conquest to Safavids"},
  {"term": "Battle of Nihavand (642 CE)", "definition": "The final major battle between Arab-Muslim and Sassanid forces, traditionally called 'the Victory of Victories' (Fath al-Futuh) by Arab historians — effectively ending organized Sassanid resistance and sealing Iran's incorporation into the Islamic caliphate.", "section": "005", "sectionName": "Islamic Conquest to Safavids"},
  {"term": "Shu'ubiyya", "definition": "The literary and cultural movement (8th-10th centuries CE) among non-Arab Muslims, especially Persians, asserting cultural equality or superiority against Arab ethnic chauvinism — a crucial moment in the preservation of Persian identity within Islam.", "section": "005", "sectionName": "Islamic Conquest to Safavids"},
  {"term": "Samanid dynasty (819-999 CE)", "definition": "A Persian dynasty ruling in Transoxiana and Khorasan that sponsored the revival of Persian language and literature, patronizing Rudaki, Daqiqi, and the early Shahnameh project — the political vehicle for the Persian cultural renaissance.", "section": "005", "sectionName": "Islamic Conquest to Safavids"},
  {"term": "Buyid dynasty (934-1062 CE)", "definition": "A Shia Iranian dynasty from the Daylam region that captured Baghdad (945 CE) and controlled the Abbasid caliphs, patronizing Shia scholarship and institutions during what is sometimes called the 'Shia Century.'", "section": "005", "sectionName": "Islamic Conquest to Safavids"},
  {"term": "Seljuq Empire (1037-1194 CE)", "definition": "A Turkic Sunni dynasty that conquered Iran, Iraq, and Anatolia, establishing the pattern of Turkic military rule over Persian-administered territories and sponsoring the nizam al-mulk administrative system and the madrasa educational network.", "section": "005", "sectionName": "Islamic Conquest to Safavids"},
  {"term": "Nizam al-Mulk", "definition": "The great Persian vizier (1018-1092 CE) who served the Seljuq sultans and authored the Siyasatnama (Book of Government) — one of the most influential works on Islamic statecraft, and a key figure in the Iranian bureaucratic tradition.", "section": "005", "sectionName": "Islamic Conquest to Safavids"},
  {"term": "Mongol invasion (1219-1258)", "definition": "The catastrophic invasion of Iran by Genghis Khan and his successors, causing massive population loss (estimates range from hundreds of thousands to millions of deaths), destruction of cities and irrigation systems, and long-term economic and demographic decline.", "section": "005", "sectionName": "Islamic Conquest to Safavids"},
  {"term": "Ilkhanate (1256-1335)", "definition": "The Mongol successor state ruling Iran and Iraq, founded by Hulagu Khan — initially devastating but eventually converting to Islam and patronizing Persian culture, producing significant architectural and artistic achievements.", "section": "005", "sectionName": "Islamic Conquest to Safavids"},
  {"term": "Timur (Tamerlane, 1336-1405)", "definition": "The Turco-Mongol conqueror who devastated much of Iran through military campaigns while his successors (the Timurids) patronized a remarkable cultural renaissance in Herat and Samarkand — epitomizing the paradox of destruction enabling artistic flourishing.", "section": "005", "sectionName": "Islamic Conquest to Safavids"},
  {"term": "Safavid dynasty (1501-1736)", "definition": "The dynasty that converted Iran to Twelver Shia Islam and established the borders, sectarian identity, and state structure of modern Iran — arguably the most consequential dynasty in Iranian history for the country's present form.", "section": "005", "sectionName": "Islamic Conquest to Safavids"},
  {"term": "Shah Ismail I (1487-1524)", "definition": "Founder of the Safavid dynasty who conquered Iran beginning in 1501 and imposed Twelver Shia Islam as the state religion — a revolutionary act that transformed Iran's religious identity and distinguished it from its Sunni neighbors.", "section": "005", "sectionName": "Islamic Conquest to Safavids"},
  {"term": "Shah Abbas I (r. 1588-1629)", "definition": "The greatest Safavid ruler, who reformed the military, centralized administration, built Isfahan into one of the world's great capitals ('Nesf-e Jahan' — Half the World), and established Iran as a major power between the Ottoman and Mughal empires.", "section": "005", "sectionName": "Islamic Conquest to Safavids"},
  {"term": "Twelver Shi'ism", "definition": "The dominant branch of Shia Islam, recognizing twelve divinely appointed Imams descending from Ali and Fatimah, with the Twelfth Imam (the Mahdi) in occultation — the official religion of Iran since the Safavid conversion and the basis of the Islamic Republic's legitimating ideology.", "section": "005", "sectionName": "Islamic Conquest to Safavids"},

  {"term": "Qajar dynasty", "definition": "The Turkic dynasty that ruled Iran from 1789 to 1925, presiding over territorial losses, foreign concessions, and the country's first encounters with European modernity.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},
  {"term": "Treaty of Turkmenchay (1828)", "definition": "Treaty ending the Russo-Persian War that ceded the Caucasus to Russia, imposed capitulations, and became a symbol of Iran's humiliation by foreign powers.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},
  {"term": "Tobacco Protest (1891-1892)", "definition": "Mass movement led by clerics and merchants against a British tobacco concession, resulting in its cancellation — the first successful popular political mobilization in modern Iran.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},
  {"term": "Constitutional Revolution (Mashrouteh)", "definition": "The 1905-1911 movement that established Iran's first constitution and parliament (Majles), representing the country's first experiment with democratic governance.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},
  {"term": "Reza Shah Pahlavi", "definition": "Military officer who rose to power as Reza Khan, became Shah in 1925, and pursued aggressive state-led modernization until forced to abdicate by the Allies in 1941.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},
  {"term": "Anglo-Iranian Oil Company (AIOC)", "definition": "British-controlled company (formerly Anglo-Persian Oil Company) that held monopoly rights over Iran's oil, paying Iran a fraction of revenues — the focal point of the nationalization crisis.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},
  {"term": "Mohammad Mossadegh", "definition": "Prime Minister of Iran (1951-1953) who led the oil nationalization movement and was removed in the 1953 coup — a figure claimed by multiple political traditions.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},
  {"term": "Operation TPAJAX", "definition": "The joint CIA/MI6 covert operation in August 1953 that overthrew Mossadegh's government and restored Mohammad Reza Shah to full power.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},
  {"term": "White Revolution (1963)", "definition": "Mohammad Reza Shah's top-down reform program including land reform, women's suffrage, and literacy campaigns — designed to modernize Iran while bypassing democratic participation.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},
  {"term": "SAVAK", "definition": "The Shah's secret police (Sazman-e Ettelaat va Amniyat-e Keshvar), established in 1957 with CIA/Mossad assistance, responsible for surveillance, censorship, and repression of dissent.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},
  {"term": "Capitulations", "definition": "Legal privileges granting foreign nationals immunity from Iranian law — a symbol of national humiliation that Reza Shah abolished in 1928.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},
  {"term": "Majles", "definition": "Iran's national parliament, first established during the Constitutional Revolution of 1906, which has existed in various forms and with varying degrees of power since.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},
  {"term": "Mohammad Reza Shah Pahlavi", "definition": "Iran's last shah (r. 1941-1979), who presided over rapid modernization, oil-fueled growth, and increasing political repression until overthrown by the 1979 Revolution.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},
  {"term": "National Front (Jebhe-ye Melli)", "definition": "Coalition of nationalist, liberal, and social-democratic parties founded by Mossadegh in 1949 to pursue oil nationalization and democratic governance.", "section": "006", "sectionName": "Modern Iran — Qajars to Pahlavis"},

  {"term": "Velayat-e faqih", "definition": "Khomeini's political theory of 'Guardianship of the Jurist,' arguing that in the absence of the Hidden Imam, a qualified Islamic jurist should hold supreme political authority — the ideological foundation of the Islamic Republic.", "section": "007", "sectionName": "The 1979 Revolution"},
  {"term": "Ruhollah Khomeini", "definition": "Senior Shia cleric (1902-1989) who led the 1979 Revolution from exile, became Supreme Leader, and established the Islamic Republic — the single most consequential figure in modern Iranian history.", "section": "007", "sectionName": "The 1979 Revolution"},
  {"term": "Black Friday (September 8, 1978)", "definition": "The massacre of protesters at Jaleh Square in Tehran by the Shah's military, killing an estimated 64-300 people and marking the point of no return for the revolution.", "section": "007", "sectionName": "The 1979 Revolution"},
  {"term": "Revolutionary coalition", "definition": "The temporary alliance of Islamists, Marxists (Tudeh, Fedayeen), nationalists (National Front), liberals (Freedom Movement), and others who united to overthrow the Shah but rapidly fragmented afterward.", "section": "007", "sectionName": "The 1979 Revolution"},
  {"term": "Mehdi Bazargan", "definition": "Liberal Islamist leader of the Freedom Movement (Nehzat-e Azadi) who served as the first post-revolution Prime Minister (February-November 1979) before being sidelined by radicals.", "section": "007", "sectionName": "The 1979 Revolution"},
  {"term": "Hostage crisis", "definition": "The seizure of the US Embassy in Tehran on November 4, 1979, and the 444-day captivity of 52 American diplomats — an event that radicalized the revolution and destroyed Iran-US relations.", "section": "007", "sectionName": "The 1979 Revolution"},
  {"term": "Iran-Iraq War (1980-1988)", "definition": "Eight-year war launched by Iraq's Saddam Hussein that killed an estimated 500,000-1,000,000 people on both sides and served as a consolidation mechanism for the Islamic Republic.", "section": "007", "sectionName": "The 1979 Revolution"},
  {"term": "Tudeh Party", "definition": "Iran's main communist party, founded in 1941, which initially supported the Islamic Republic before being destroyed by the regime in 1983 with thousands of members arrested and executed.", "section": "007", "sectionName": "The 1979 Revolution"},
  {"term": "Fedayeen-e Khalq", "definition": "Marxist-Leninist guerrilla organization active from the 1970s, which split into majority (pro-Tudeh) and minority (anti-regime) factions after the revolution.", "section": "007", "sectionName": "The 1979 Revolution"},
  {"term": "Mujahedin-e Khalq (MEK/PMOI)", "definition": "Organization blending Islam and Marxism, initially part of the revolutionary coalition, later suppressed domestically and based in Iraq — the most controversial of Iran's opposition groups.", "section": "007", "sectionName": "The 1979 Revolution"},
  {"term": "Islamic Republican Party (IRP)", "definition": "The clerical party led by Beheshti, Khamenei, and Rafsanjani that served as Khomeini's instrument for consolidating power and eliminating rival political organizations (1979-1987).", "section": "007", "sectionName": "The 1979 Revolution"},
  {"term": "Cultural Revolution (1980-1983)", "definition": "The closure of Iranian universities for over two years to purge leftist and liberal faculty, restructure curricula according to Islamic principles, and eliminate non-Islamist student organizations.", "section": "007", "sectionName": "The 1979 Revolution"},
  {"term": "1988 prison massacres", "definition": "The execution of an estimated 4,000-8,000 political prisoners (primarily MEK members and leftists) in summer 1988 on Khomeini's order, the single largest mass killing of political prisoners in the Islamic Republic's history.", "section": "007", "sectionName": "The 1979 Revolution"},
  {"term": "Dual sovereignty", "definition": "The brief period (February-November 1979) when the Provisional Government under Bazargan and the Revolutionary Council under Khomeini's allies competed for power, with revolutionary committees and courts operating outside government control.", "section": "007", "sectionName": "The 1979 Revolution"},

  {"term": "Ali Khamenei", "definition": "Iran's Supreme Leader since 1989, a mid-ranking cleric elevated after Khomeini's death, who consolidated power over three decades to become the single most powerful figure in the Islamic Republic.", "section": "008", "sectionName": "The Islamic Republic — 1989 to Present"},
  {"term": "Akbar Hashemi Rafsanjani", "definition": "Powerful cleric-politician who served as president (1989-1997), pursued economic liberalization and pragmatic foreign policy, and remained a key power broker until his death in 2017.", "section": "008", "sectionName": "The Islamic Republic — 1989 to Present"},
  {"term": "Mohammad Khatami", "definition": "Reform-minded president (1997-2005) who won landslide elections, expanded press freedom and civil society, but was systematically blocked by unelected institutions — the defining figure of Iran's reform era.", "section": "008", "sectionName": "The Islamic Republic — 1989 to Present"},
  {"term": "Guardian Council", "definition": "Twelve-member body (six clerics appointed by the Supreme Leader, six jurists) with power to vet electoral candidates and veto legislation — the principal institutional barrier to reform.", "section": "008", "sectionName": "The Islamic Republic — 1989 to Present"},
  {"term": "Green Movement", "definition": "Mass protest movement following the disputed June 2009 presidential election, led by Mir-Hossein Mousavi and Mehdi Karroubi, brutally suppressed with dozens killed and thousands arrested.", "section": "008", "sectionName": "The Islamic Republic — 1989 to Present"},
  {"term": "JCPOA (Joint Comprehensive Plan of Action)", "definition": "The 2015 nuclear agreement between Iran and the P5+1 powers, which limited Iran's nuclear program in exchange for sanctions relief — subsequently abandoned by the Trump administration in 2018.", "section": "008", "sectionName": "The Islamic Republic — 1989 to Present"},
  {"term": "Maximum pressure", "definition": "The Trump administration's strategy (2018-2021) of reimposing and escalating sanctions after withdrawing from the JCPOA, aiming to force Iran into a more comprehensive deal or collapse.", "section": "008", "sectionName": "The Islamic Republic — 1989 to Present"},
  {"term": "November 2019 protests (Aban 98)", "definition": "Nationwide protests triggered by a sudden fuel price increase, met with an internet shutdown and the killing of an estimated 1,500 protesters — the deadliest crackdown since the 1980s.", "section": "008", "sectionName": "The Islamic Republic — 1989 to Present"},
  {"term": "Woman, Life, Freedom (Zan, Zendegi, Azadi)", "definition": "The 2022 protest movement sparked by the death of Mahsa (Jina) Amini in morality police custody, notable for its feminist leadership, Kurdish origins, and explicit rejection of the Islamic Republic.", "section": "008", "sectionName": "The Islamic Republic — 1989 to Present"},
  {"term": "Mahmoud Ahmadinejad", "definition": "Hardline populist president (2005-2013) known for Holocaust denial, confrontational nuclear policy, economic mismanagement, and the fraudulent 2009 election that triggered the Green Movement.", "section": "008", "sectionName": "The Islamic Republic — 1989 to Present"},
  {"term": "Hassan Rouhani", "definition": "Centrist president (2013-2021) who negotiated the JCPOA but failed to deliver lasting economic improvement after the deal's collapse, symbolizing the limits of engagement within the system.", "section": "008", "sectionName": "The Islamic Republic — 1989 to Present"},
  {"term": "Ebrahim Raisi", "definition": "Hardline president (2021-2024), a judiciary chief implicated in the 1988 prison massacres, whose selection through heavily restricted elections symbolized the system's closure to reformist participation.", "section": "008", "sectionName": "The Islamic Republic — 1989 to Present"},
  {"term": "Mahsa (Jina) Amini", "definition": "22-year-old Kurdish-Iranian woman whose death in morality police custody on September 16, 2022, sparked the Woman, Life, Freedom uprising — the most significant challenge to the Islamic Republic since 1979.", "section": "008", "sectionName": "The Islamic Republic — 1989 to Present"},

  {"term": "Demographic transition", "definition": "Iran's dramatic shift from one of the world's highest fertility rates (6.5 children per woman in 1980) to one of the lowest (1.7 in 2023), representing one of the fastest demographic transitions in recorded history.", "section": "009", "sectionName": "Iran Today — Society, Economy, Demographics"},
  {"term": "Brain drain (faraar-e maghzha)", "definition": "The emigration of educated and skilled Iranians, estimated at 150,000-180,000 per year, costing Iran an estimated $150 billion in human capital according to IMF methodology — one of the highest rates globally.", "section": "009", "sectionName": "Iran Today — Society, Economy, Demographics"},
  {"term": "Youth bulge", "definition": "The disproportionately large cohort of Iranians born during the 1980s baby boom (during the Iran-Iraq War), who are now in their 30s-40s and face high unemployment, housing costs, and limited opportunities.", "section": "009", "sectionName": "Iran Today — Society, Economy, Demographics"},
  {"term": "Informal/underground economy", "definition": "Economic activity outside the formal tax and regulatory system, estimated at 25-40% of Iran's GDP, including smuggling networks, unlicensed businesses, and the grey market in foreign currency.", "section": "009", "sectionName": "Iran Today — Society, Economy, Demographics"},
  {"term": "National Information Network (NIN/SHOMA)", "definition": "Iran's domestic internet infrastructure project, designed to create a controllable national intranet that can function independently of the global internet during shutdowns.", "section": "009", "sectionName": "Iran Today — Society, Economy, Demographics"},
  {"term": "Purchasing power", "definition": "The real value of Iranians' income in terms of what it can buy — which has collapsed as the rial has fallen from approximately 10,000 per dollar (2011) to over 500,000 per dollar (2024) on the open market.", "section": "009", "sectionName": "Iran Today — Society, Economy, Demographics"},
  {"term": "Konkur", "definition": "Iran's national university entrance examination, which determines university placement and is one of the most competitive in the world, reflecting the enormous social importance placed on higher education.", "section": "009", "sectionName": "Iran Today — Society, Economy, Demographics"},
  {"term": "Drug addiction crisis", "definition": "Iran has one of the world's highest rates of opioid addiction, with an estimated 2.8-3.5 million users (official estimates vary), driven by proximity to Afghan opium production, unemployment, and social despair.", "section": "009", "sectionName": "Iran Today — Society, Economy, Demographics"},
  {"term": "Gender paradox", "definition": "The contradiction between women's legal subordination under the Islamic Republic's legal code and their actual achievements: women constitute over 60% of university students and are increasingly present in professional and public life.", "section": "009", "sectionName": "Iran Today — Society, Economy, Demographics"},
  {"term": "State-society gap", "definition": "The widening divergence between the Islamic Republic's official ideology and the values, behaviors, and aspirations of the majority of Iranian society, visible in declining religiosity, rising individualism, and protest movements.", "section": "009", "sectionName": "Iran Today — Society, Economy, Demographics"},
  {"term": "Resistance economy (eqtesad-e moqaavemati)", "definition": "Khamenei's economic doctrine calling for self-sufficiency and reduced dependence on oil exports and imports — the regime's response to sanctions, criticized as producing inefficiency and corruption.", "section": "009", "sectionName": "Iran Today — Society, Economy, Demographics"},
  {"term": "Urban-rural divide", "definition": "The significant gap in income, services, infrastructure, and social indicators between Iran's major cities (especially Tehran) and its rural areas and smaller towns, which has political implications.", "section": "009", "sectionName": "Iran Today — Society, Economy, Demographics"},

  {"term": "Principalists (Osulgarayan)", "definition": "The conservative-hardline faction within the Islamic Republic that emphasizes the 'principles' of the revolution, loyalty to the Supreme Leader, and resistance to Western influence — the dominant faction since approximately 2005.", "section": "010", "sectionName": "The Revolutionary Landscape"},
  {"term": "Reformists (Eslah-talaban)", "definition": "The faction within the Islamic Republic that sought gradual political liberalization, expanded civil liberties, and economic reform within the existing constitutional framework — marginalized since 2009.", "section": "010", "sectionName": "The Revolutionary Landscape"},
  {"term": "IRGC (Sepah-e Pasdaran)", "definition": "The Islamic Revolutionary Guard Corps, originally the revolution's militia, now a parallel military, intelligence service, and economic conglomerate controlling an estimated 20-40% of Iran's GDP through subsidiaries and front companies.", "section": "010", "sectionName": "The Revolutionary Landscape"},
  {"term": "Basij", "definition": "Paramilitary volunteer militia under IRGC command, with an estimated 5-11 million members, used for internal repression, social surveillance, and as a patronage and mobilization network.", "section": "010", "sectionName": "The Revolutionary Landscape"},
  {"term": "Reza Pahlavi", "definition": "Son of the last Shah, the most prominent figure in the monarchist diaspora, who in recent years has rebranded as an advocate for secular democracy and a 'unifying figure' — a role his supporters champion and his critics dispute.", "section": "010", "sectionName": "The Revolutionary Landscape"},
  {"term": "National Council of Resistance of Iran (NCRI)", "definition": "The MEK-dominated coalition claiming to be Iran's 'parliament in exile,' which presents itself as a democratic alternative while facing criticism for authoritarian internal structures and questionable support claims.", "section": "010", "sectionName": "The Revolutionary Landscape"},
  {"term": "PJAK (Party of Free Life of Kurdistan)", "definition": "Kurdish armed group affiliated with the PKK, active in Iranian Kurdistan, which has conducted guerrilla operations against the IRGC and advocates for Kurdish self-determination within a federalized Iran.", "section": "010", "sectionName": "The Revolutionary Landscape"},
  {"term": "Jundallah / Jaish al-Adl", "definition": "Baloch insurgent groups in Sistan-Baluchestan province, operating along the Pakistan border, motivated by a combination of Sunni sectarian grievance, ethnic discrimination, and separatist or autonomy demands.", "section": "010", "sectionName": "The Revolutionary Landscape"},
  {"term": "Independent labor unions", "definition": "Worker organizations operating outside the regime-controlled Islamic Labor Councils, including the Syndicate of Workers of Tehran Bus Company and the Haft Tappeh Sugarcane Workers' Union — routinely repressed but persistent.", "section": "010", "sectionName": "The Revolutionary Landscape"},
  {"term": "One Million Signatures Campaign", "definition": "A grassroots feminist initiative launched in 2006 to collect signatures demanding changes to discriminatory laws against women — an example of civil-society organizing under repressive conditions.", "section": "010", "sectionName": "The Revolutionary Landscape"},
  {"term": "Georgetown Agreement / coalition attempts", "definition": "Various attempts by diaspora opposition groups to form unified coalitions, most recently including the Georgetown Declaration (2023) signed by diverse figures — illustrating both the desire for unity and the difficulty of achieving it.", "section": "010", "sectionName": "The Revolutionary Landscape"},
  {"term": "Fragmentation problem", "definition": "The persistent inability of Iran's opposition to form a sustained, unified front, due to ideological divisions (monarchist vs. republican vs. leftist vs. ethnic), personal rivalries, diaspora-homeland disconnects, and genuine policy disagreements.", "section": "010", "sectionName": "The Revolutionary Landscape"},
  {"term": "Dual sovereignty (within the regime)", "definition": "The tension between the elected institutions (presidency, Majles) and unelected power centers (Supreme Leader, Guardian Council, IRGC) — a design feature, not a bug, of the Islamic Republic's constitution.", "section": "010", "sectionName": "The Revolutionary Landscape"},

  {"term": "IRIB (Islamic Republic of Iran Broadcasting)", "definition": "Iran's state broadcasting monopoly, directly supervised by the Supreme Leader, controlling all domestic radio and television channels.", "section": "011", "sectionName": "The Information War"},
  {"term": "National Information Network (NIN / SHOMA)", "definition": "Iran's project to create a domestically controlled internet infrastructure, enabling content filtering, traffic monitoring, and potential disconnection from the global internet.", "section": "011", "sectionName": "The Information War"},
  {"term": "Supreme Council of Cyberspace", "definition": "A body established in 2012 by Supreme Leader Khamenei to set policies for internet governance, filtering, and digital content regulation in Iran.", "section": "011", "sectionName": "The Information War"},
  {"term": "Internet shutdown", "definition": "The deliberate state-imposed disconnection of internet access, used most notably during the November 2019 protests when Iran cut internet access for approximately one week.", "section": "011", "sectionName": "The Information War"},
  {"term": "VPN (Virtual Private Network)", "definition": "Encryption tools that allow users to bypass internet censorship by routing traffic through servers outside Iran; an estimated 40-80% of Iranian internet users employ VPNs.", "section": "011", "sectionName": "The Information War"},
  {"term": "Filtering committee", "definition": "The body within Iran's judiciary responsible for ordering the blocking of websites and online content deemed contrary to Islamic or national security standards.", "section": "011", "sectionName": "The Information War"},
  {"term": "Iran International", "definition": "A London-based Persian-language satellite TV and digital media outlet launched in 2017, widely watched inside Iran, with alleged Saudi funding connections.", "section": "011", "sectionName": "The Information War"},
  {"term": "BBC Persian", "definition": "The Persian-language service of the BBC, broadcasting since 1940, providing news, analysis, and cultural content to Iranian audiences via satellite, radio, and online platforms.", "section": "011", "sectionName": "The Information War"},
  {"term": "Telegram", "definition": "An encrypted messaging platform that became Iran's dominant social media and news platform, used by an estimated 40+ million Iranians before government restrictions began in 2018.", "section": "011", "sectionName": "The Information War"},
  {"term": "FATA (Cyber Police)", "definition": "Iran's specialized cyber police unit responsible for monitoring online activity, arresting dissidents for social media posts, and enforcing internet-related laws.", "section": "011", "sectionName": "The Information War"},
  {"term": "Soft war (jang-e narm)", "definition": "A concept used by Iranian authorities describing perceived cultural and informational efforts by foreign powers to undermine the Islamic Republic's legitimacy.", "section": "011", "sectionName": "The Information War"},
  {"term": "Citizen journalism", "definition": "The practice of ordinary citizens documenting and sharing news events, particularly during protests, bypassing state media gatekeepers through social media and messaging apps.", "section": "011", "sectionName": "The Information War"},
  {"term": "OSINT (Open Source Intelligence)", "definition": "Intelligence gathered from publicly available sources — satellite imagery, social media posts, public records — used by researchers and journalists to verify claims.", "section": "011", "sectionName": "The Information War"},

  {"term": "Scenario analysis", "definition": "A structured analytical method that develops multiple plausible futures based on identified key variables and uncertainties, used in strategic planning and political forecasting.", "section": "012", "sectionName": "Scenarios for Iran's Future"},
  {"term": "Authoritarian resilience", "definition": "The capacity of non-democratic regimes to survive challenges through adaptation, co-optation, repression, or a combination of these mechanisms — a concept central to the 'regime survival' scenario.", "section": "012", "sectionName": "Scenarios for Iran's Future"},
  {"term": "Revolutionary situation", "definition": "A condition in which multiple claimants to sovereign authority exist simultaneously and significant portions of the population support the challengers — as defined by Charles Tilly's framework.", "section": "012", "sectionName": "Scenarios for Iran's Future"},
  {"term": "Elite fracture", "definition": "A split within the ruling elite of an authoritarian regime that creates openings for opposition or regime change, identified by scholars as a key precondition for revolution.", "section": "012", "sectionName": "Scenarios for Iran's Future"},
  {"term": "Praetorian state", "definition": "A political system in which the military (in Iran's case, the IRGC) holds de facto veto power over governance and transitions, making its loyalty or defection the decisive variable in political change.", "section": "012", "sectionName": "Scenarios for Iran's Future"},
  {"term": "Managed transition", "definition": "A negotiated political change in which elements of the existing regime and the opposition agree on terms for a transfer of power, as occurred in Spain (1975-1982) and South Africa (1990-1994).", "section": "012", "sectionName": "Scenarios for Iran's Future"},
  {"term": "State fragmentation", "definition": "The breakdown of a state's territorial integrity along ethnic, sectarian, or regional lines, as occurred in Yugoslavia, Libya, and Syria.", "section": "012", "sectionName": "Scenarios for Iran's Future"},
  {"term": "Regime-opposition pact", "definition": "A formal or informal agreement between regime moderates and opposition leaders to manage political change, minimizing violence and ensuring mutual security guarantees.", "section": "012", "sectionName": "Scenarios for Iran's Future"},
  {"term": "Rentier state", "definition": "A state that derives a substantial portion of its revenue from external rents (typically oil), reducing its dependence on citizens for taxation and thus weakening the social contract.", "section": "012", "sectionName": "Scenarios for Iran's Future"},
  {"term": "Threshold model (Granovetter)", "definition": "A model explaining collective action cascades: each individual has a threshold of how many others must act before they join, meaning small changes in conditions can trigger rapid, nonlinear shifts in participation.", "section": "012", "sectionName": "Scenarios for Iran's Future"},
  {"term": "Security dilemma (domestic)", "definition": "A situation during transitions where each political group fears that the other will seize power and retaliate, making compromise risky and escalation likely.", "section": "012", "sectionName": "Scenarios for Iran's Future"},
  {"term": "External intervention", "definition": "The use of military force, covert operations, or severe economic pressure by foreign powers to change or preserve a regime, with consequences documented in cases from Iraq to Libya.", "section": "012", "sectionName": "Scenarios for Iran's Future"},
  {"term": "Path dependence", "definition": "The concept that past institutional choices constrain future options, meaning Iran's specific history creates a unique set of possibilities and limitations not directly comparable to other cases.", "section": "012", "sectionName": "Scenarios for Iran's Future"},

  {"term": "Social contract", "definition": "The philosophical concept that political authority derives from an agreement (explicit or implicit) among individuals to surrender certain freedoms in exchange for social order and protection — central to the theories of Hobbes, Locke, and Rousseau.", "section": "013", "sectionName": "Foundations of Political Philosophy"},
  {"term": "Separation of powers", "definition": "The principle, developed by Montesquieu, that political power should be divided among independent legislative, executive, and judicial branches to prevent any single institution from becoming tyrannical.", "section": "013", "sectionName": "Foundations of Political Philosophy"},
  {"term": "Velayat-e faqih (Guardianship of the Jurist)", "definition": "The political theory developed by Ayatollah Khomeini arguing that in the absence of the Twelfth Imam, governance authority belongs to qualified Islamic jurists — the theological foundation of the Islamic Republic's political system.", "section": "013", "sectionName": "Foundations of Political Philosophy"},
  {"term": "Natural rights", "definition": "Rights that individuals possess inherently by virtue of being human, not granted by any government — a concept central to Locke's political philosophy and influential in the American and French revolutions.", "section": "013", "sectionName": "Foundations of Political Philosophy"},
  {"term": "General will (volonte generale)", "definition": "Rousseau's concept of the collective interest of the political community as a whole, which should guide sovereign decision-making — distinguished from the 'will of all' (mere aggregation of private interests).", "section": "013", "sectionName": "Foundations of Political Philosophy"},
  {"term": "Harm principle", "definition": "Mill's principle that the only justification for restricting an individual's liberty is to prevent harm to others — a foundational concept in liberal political theory.", "section": "013", "sectionName": "Foundations of Political Philosophy"},
  {"term": "Historical materialism", "definition": "Marx's theory that the economic mode of production (the 'base') determines the political, legal, and cultural institutions (the 'superstructure') of a society, and that class struggle drives historical change.", "section": "013", "sectionName": "Foundations of Political Philosophy"},
  {"term": "Philosopher-king", "definition": "Plato's concept from The Republic that the ideal state should be governed by philosopher-rulers who possess both wisdom and virtue, rather than by the masses or by those who merely seek power.", "section": "013", "sectionName": "Foundations of Political Philosophy"},
  {"term": "Al-Madina al-Fadila (The Virtuous City)", "definition": "Al-Farabi's concept of the ideal political community, governed by a philosopher-prophet who combines intellectual wisdom with prophetic revelation — a synthesis of Platonic and Islamic political thought.", "section": "013", "sectionName": "Foundations of Political Philosophy"},
  {"term": "Asabiyyah (social cohesion)", "definition": "Ibn Khaldun's concept of group solidarity or social cohesion that enables a group to gain and maintain political power — central to his cyclical theory of the rise and fall of civilizations in the Muqaddimah.", "section": "013", "sectionName": "Foundations of Political Philosophy"},
  {"term": "Veil of ignorance", "definition": "Rawls's thought experiment in which individuals choose principles of justice without knowing their own position in society, intended to produce fair principles because rational self-interest behind the veil leads to concern for the worst-off.", "section": "013", "sectionName": "Foundations of Political Philosophy"},
  {"term": "State of nature", "definition": "A hypothetical pre-political condition used by social contract theorists to justify political authority — depicted as war by Hobbes, as freedom with inconveniences by Locke, and as innocent solitude by Rousseau.", "section": "013", "sectionName": "Foundations of Political Philosophy"},
  {"term": "Tyranny of the majority", "definition": "The concept, articulated by Tocqueville and Mill, that democratic majority rule can itself become oppressive if it overrides individual rights and minority interests without institutional checks.", "section": "013", "sectionName": "Foundations of Political Philosophy"},
  {"term": "Political legitimacy", "definition": "The basis on which a government claims the right to rule — derived variously from divine right, popular consent, revolutionary mandate, constitutional authority, or (in Khomeini's theory) juristic guardianship.", "section": "013", "sectionName": "Foundations of Political Philosophy"},

  {"term": "Liberal democracy", "definition": "A political system combining majority rule through free elections with constitutional protections for individual rights, rule of law, and institutional checks on power — distinguished from illiberal or electoral democracy.", "section": "014", "sectionName": "How Democracies Work"},
  {"term": "Electoral democracy", "definition": "A system with competitive elections but potentially lacking full protections for civil liberties, judicial independence, or minority rights — what Fareed Zakaria termed 'illiberal democracy.'", "section": "014", "sectionName": "How Democracies Work"},
  {"term": "Constitutional supremacy", "definition": "The principle that the constitution is the highest law of the land, binding on all branches of government, and enforceable by an independent judiciary.", "section": "014", "sectionName": "How Democracies Work"},
  {"term": "Proportional representation (PR)", "definition": "An electoral system in which legislative seats are allocated in proportion to the share of votes each party receives, tending to produce multi-party systems and coalition governments.", "section": "014", "sectionName": "How Democracies Work"},
  {"term": "First-past-the-post (FPTP)", "definition": "A majoritarian electoral system in which the candidate with the most votes in each district wins the seat, tending to produce two-party systems and single-party governments.", "section": "014", "sectionName": "How Democracies Work"},
  {"term": "Checks and balances", "definition": "Institutional mechanisms by which each branch of government can limit the power of the other branches, preventing any single branch from accumulating excessive authority.", "section": "014", "sectionName": "How Democracies Work"},
  {"term": "Judicial review", "definition": "The power of courts to examine legislation and executive actions for constitutionality and to strike down those that violate constitutional provisions.", "section": "014", "sectionName": "How Democracies Work"},
  {"term": "Federalism", "definition": "A system of government in which sovereignty is constitutionally divided between a central authority and constituent political units (states, provinces, regions), each with defined powers.", "section": "014", "sectionName": "How Democracies Work"},
  {"term": "Devolution", "definition": "The transfer of powers from a central government to regional or local governments, which may be reversed by the central authority — distinguished from federalism, which is constitutionally protected.", "section": "014", "sectionName": "How Democracies Work"},
  {"term": "Civil society", "definition": "The sphere of voluntary organizations, associations, and institutions — independent of both the state and the market — that enable citizens to participate in public life, including NGOs, professional associations, religious organizations, media, and community groups.", "section": "014", "sectionName": "How Democracies Work"},
  {"term": "Democratic backsliding", "definition": "The gradual erosion of democratic norms and institutions by elected leaders who use legal mechanisms to concentrate power — documented in Hungary, Turkey, Poland, and elsewhere.", "section": "014", "sectionName": "How Democracies Work"},
  {"term": "Consociationalism", "definition": "A power-sharing model for deeply divided societies (ethnic, religious, or linguistic) in which political representation is guaranteed for each major group — used in Lebanon, Belgium, and Northern Ireland.", "section": "014", "sectionName": "How Democracies Work"},
  {"term": "Rule of law", "definition": "The principle that all persons and institutions, including the government itself, are subject to and accountable under law that is publicly promulgated, equally enforced, and independently adjudicated.", "section": "014", "sectionName": "How Democracies Work"},
  {"term": "Franchise", "definition": "The right to vote in elections — its expansion from propertied males to universal adult suffrage represents one of the central historical trajectories of democratic development.", "section": "014", "sectionName": "How Democracies Work"},

  {"term": "Velayat-e faqih (Guardianship of the Jurist)", "definition": "The constitutional principle (Article 5) that vests supreme political authority in a qualified Islamic jurist (the Supreme Leader), making religious authority the foundation of political sovereignty in the Islamic Republic.", "section": "015", "sectionName": "The Islamic Republic's System"},
  {"term": "Supreme Leader (Rahbar)", "definition": "The highest authority in the Islamic Republic, commander-in-chief of the armed forces, with power to appoint the head of the judiciary, half the Guardian Council, the heads of state broadcasting, and military commanders — currently Ali Khamenei (since 1989).", "section": "015", "sectionName": "The Islamic Republic's System"},
  {"term": "Guardian Council (Shora-ye Negahban)", "definition": "A 12-member body (6 clerics appointed by the Supreme Leader, 6 jurists nominated by the judiciary and approved by the Majles) with the power to vet all candidates for elected office and to veto any legislation deemed inconsistent with Islam or the constitution.", "section": "015", "sectionName": "The Islamic Republic's System"},
  {"term": "Assembly of Experts (Majles-e Khobregan)", "definition": "An 88-member elected body of senior clerics constitutionally responsible for selecting, supervising, and potentially dismissing the Supreme Leader — though in practice it has never exercised oversight.", "section": "015", "sectionName": "The Islamic Republic's System"},
  {"term": "Expediency Discernment Council (Majma-ye Tashkhis-e Maslahat)", "definition": "An advisory body appointed by the Supreme Leader to resolve disputes between the Majles and the Guardian Council and to advise on systemic policies — headed by a figure chosen for political balancing.", "section": "015", "sectionName": "The Islamic Republic's System"},
  {"term": "IRGC (Sepah-e Pasdaran)", "definition": "The Islamic Revolutionary Guard Corps, a parallel military force created in 1979 to protect the revolution, which has expanded into a military-economic-political conglomerate controlling an estimated 20-40% of Iran's GDP.", "section": "015", "sectionName": "The Islamic Republic's System"},
  {"term": "Basij (Mobilization Resistance Force)", "definition": "A paramilitary volunteer organization under IRGC command, with an estimated membership of several million, used for internal security, social control, surveillance, and the suppression of protests.", "section": "015", "sectionName": "The Islamic Republic's System"},
  {"term": "Bonyad (Foundation)", "definition": "Revolutionary foundations — originally formed from confiscated assets of the Shah's regime — that have grown into massive economic conglomerates operating outside normal regulatory oversight. The largest, Bonyad-e Mostazafan, controls billions in assets.", "section": "015", "sectionName": "The Islamic Republic's System"},
  {"term": "MOIS (Vezarat-e Ettela'at)", "definition": "The Ministry of Intelligence and Security, Iran's primary civilian intelligence agency responsible for domestic surveillance, counter-intelligence, and monitoring of dissidents both inside Iran and abroad.", "section": "015", "sectionName": "The Islamic Republic's System"},
  {"term": "Majles (Islamic Consultative Assembly)", "definition": "Iran's 290-seat parliament, elected by popular vote but with all candidates pre-vetted by the Guardian Council, limiting its legislative independence to issues that do not challenge the regime's fundamental interests.", "section": "015", "sectionName": "The Islamic Republic's System"},
  {"term": "Approbative supervision (nezarat-e estesvabi)", "definition": "The Guardian Council's interpretation of its constitutional supervisory role as including the power to approve or reject candidates for election — a reading that transformed elections from competitive to curated processes.", "section": "015", "sectionName": "The Islamic Republic's System"},
  {"term": "Parallel institutions", "definition": "A defining feature of the Islamic Republic in which unelected bodies (Supreme Leader's office, Guardian Council, IRGC) operate alongside elected institutions (presidency, Majles), with the former holding ultimate authority over the latter.", "section": "015", "sectionName": "The Islamic Republic's System"},
  {"term": "Khodis and gheyr-e khodis (insiders and outsiders)", "definition": "The informal categorization of individuals within the Islamic Republic's power structure as either 'one of us' (loyal to the system) or 'not one of us' (suspect or excluded), determining access to economic and political opportunities.", "section": "015", "sectionName": "The Islamic Republic's System"},
  {"term": "Rentier patronage", "definition": "The use of oil revenue and state-controlled economic resources to maintain loyalty among key constituencies — including IRGC officers, regime-connected clerics, and bonyad beneficiaries — without accountability to taxpayers.", "section": "015", "sectionName": "The Islamic Republic's System"},

  {"term": "Constitutional Design", "definition": "The deliberate process of creating the foundational legal framework that defines a state's structure, distributes power among institutions, and establishes the rights of citizens.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Parliamentary System", "definition": "A form of government where the executive (prime minister) is drawn from and accountable to the legislature, allowing the parliament to remove the government through a vote of no confidence.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Presidential System", "definition": "A form of government where the executive (president) is elected independently of the legislature and serves a fixed term, with separate sources of democratic legitimacy.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Semi-Presidential System", "definition": "A hybrid system combining a directly elected president with a prime minister accountable to the legislature, as practiced in France and several post-Soviet states.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Federalism", "definition": "A system of government in which sovereignty is constitutionally divided between a central authority and constituent political units (states, provinces, or regions), each with defined powers.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Unitary State", "definition": "A system of government where sovereignty resides in the central government, which may delegate but can also revoke powers from subnational units.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Laicite", "definition": "The French model of secularism that strictly separates religion from the state, confining religion to the private sphere and prohibiting religious symbols in public institutions.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Accommodationist Secularism", "definition": "A model of secularism that maintains state neutrality toward religion while allowing religious expression in public life and providing some state support to religious communities on an equal basis.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Transitional Justice", "definition": "The set of judicial and non-judicial mechanisms societies employ to address legacies of massive human rights abuses, including trials, truth commissions, reparations, and institutional reform.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Lustration", "definition": "The process of screening or barring former officials of an authoritarian regime from holding public office in a new democratic government.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Proportional Representation", "definition": "An electoral system in which the proportion of seats a party wins in the legislature corresponds closely to its share of the total vote.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Consociationalism", "definition": "A power-sharing model for divided societies, characterized by grand coalitions, mutual vetoes, proportionality in public appointments, and group autonomy, as theorized by Arend Lijphart.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Sovereign Wealth Fund", "definition": "A state-owned investment fund, often financed by resource revenues, designed to save wealth for future generations and insulate the budget from commodity price volatility.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Civilian Control of the Military", "definition": "The principle that ultimate authority over a nation's armed forces rests with elected civilian leaders rather than military officers, institutionalized through constitutional and legal frameworks.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},
  {"term": "Entrenchment", "definition": "The constitutional mechanism that makes certain provisions more difficult to amend than ordinary legislation, protecting fundamental rights and structural arrangements from simple majority override.", "section": "016", "sectionName": "Constitutional Design for Iran's Future"},

  {"term": "Revolution", "definition": "The overthrow or fundamental transformation of a political regime through mass mobilization, resulting in a significant change in the structures of political authority and often in social relations.", "section": "017", "sectionName": "The Science of Revolution"},
  {"term": "Structural Theory of Revolution", "definition": "Theda Skocpol's theory that revolutions result from the convergence of state crisis (international military pressure and fiscal collapse), elite defection, and autonomous peasant or popular mobilization — not from ideology or organization alone.", "section": "017", "sectionName": "The Science of Revolution"},
  {"term": "Demographic-Structural Theory", "definition": "Jack Goldstone's model explaining state breakdown through the interaction of population growth, resource competition, elite overproduction, fiscal crisis, and mass mobilization potential.", "section": "017", "sectionName": "The Science of Revolution"},
  {"term": "Nonviolent Action", "definition": "A method of political struggle that uses protest, noncooperation, and intervention without physical violence to undermine the pillars of support (military, bureaucracy, economy, legitimacy) that sustain an authoritarian regime.", "section": "017", "sectionName": "The Science of Revolution"},
  {"term": "Pillars of Support", "definition": "In Gene Sharp's framework, the institutions and social groups whose cooperation an authoritarian regime depends on: military, police, civil service, business community, religious institutions, and the general population.", "section": "017", "sectionName": "The Science of Revolution"},
  {"term": "Thermidor", "definition": "Named after the French Revolutionary month when Robespierre fell, the phase in a revolution when the radical faction is displaced by moderates or pragmatists, often accompanied by a consolidation of power and a retreat from revolutionary ideals.", "section": "017", "sectionName": "The Science of Revolution"},
  {"term": "Revolutionary Coalition", "definition": "The temporary alliance of diverse political groups — often with incompatible long-term goals — that unites to overthrow an existing regime.", "section": "017", "sectionName": "The Science of Revolution"},
  {"term": "Military Defection", "definition": "The decision by armed forces, or a significant portion of them, to refuse orders to suppress a popular movement, effectively withdrawing the regime's coercive capacity.", "section": "017", "sectionName": "The Science of Revolution"},
  {"term": "Elite Fragmentation", "definition": "The breakdown of unity among a regime's ruling class, creating internal divisions that weaken the regime's capacity to respond coherently to challenges.", "section": "017", "sectionName": "The Science of Revolution"},
  {"term": "Color Revolution", "definition": "A type of nonviolent, largely peaceful mass protest movement that aims to remove authoritarian leaders through electoral pressure and civic resistance, named after the color-coded movements in post-Soviet states (e.g., Orange Revolution in Ukraine, Rose Revolution in Georgia).", "section": "017", "sectionName": "The Science of Revolution"},
  {"term": "Regime Legitimacy Crisis", "definition": "A condition in which a significant portion of the population and/or elites no longer accept the regime's right to rule, undermining compliance and creating conditions for collective action.", "section": "017", "sectionName": "The Science of Revolution"},
  {"term": "Social Revolution", "definition": "A revolution that transforms not only the political regime but also the class structure and social relations of the society, as in the French, Russian, and Chinese revolutions.", "section": "017", "sectionName": "The Science of Revolution"},
  {"term": "The Dictator's Dilemma", "definition": "The problem faced by authoritarian rulers who cannot accurately gauge public opinion because repression incentivizes citizens to hide their true preferences, making the regime vulnerable to sudden, unexpected mass mobilization.", "section": "017", "sectionName": "The Science of Revolution"},

  {"term": "Pacted Transition", "definition": "A negotiated transition in which regime elites and opposition leaders reach explicit or implicit agreements on the rules of the new political order, often including guarantees for outgoing elites, as in Spain and Chile.", "section": "018", "sectionName": "Successful Transitions"},
  {"term": "Democratization", "definition": "The process of transitioning from an authoritarian political system to a democratic one, encompassing liberalization (expanding political freedoms), transition (changing the regime), and consolidation (stabilizing democratic institutions).", "section": "018", "sectionName": "Successful Transitions"},
  {"term": "Transition by Rupture", "definition": "A mode of democratization in which the old regime collapses rapidly — through revolution, coup, or sudden loss of legitimacy — rather than through negotiation, as in Portugal 1974 or Romania 1989.", "section": "018", "sectionName": "Successful Transitions"},
  {"term": "Democratic Consolidation", "definition": "The process by which a new democracy becomes stable enough that all major political actors accept democratic rules as 'the only game in town' (Linz and Stepan), making democratic breakdown unlikely.", "section": "018", "sectionName": "Successful Transitions"},
  {"term": "Reformasi", "definition": "The Indonesian term for the reform era that followed the fall of President Suharto in 1998, encompassing democratization, decentralization, and institutional reform.", "section": "018", "sectionName": "Successful Transitions"},
  {"term": "Roundtable Agreement", "definition": "The negotiated pact between Poland's Communist government and the Solidarity trade union in 1989, which established semi-free elections and created the framework for peaceful regime change.", "section": "018", "sectionName": "Successful Transitions"},
  {"term": "Moncloa Pacts", "definition": "The 1977 agreements among Spanish political parties, unions, and employers' organizations that stabilized Spain's economy and political process during the transition from Francoism to democracy.", "section": "018", "sectionName": "Successful Transitions"},
  {"term": "Lustration", "definition": "The process of vetting or barring former officials of an authoritarian regime from holding positions in the new democratic government, practiced extensively in the Czech Republic and other post-Communist states.", "section": "018", "sectionName": "Successful Transitions"},
  {"term": "CODESA", "definition": "The Convention for a Democratic South Africa (1991-1993), the multi-party negotiating forum that produced the interim constitution and framework for South Africa's transition from apartheid.", "section": "018", "sectionName": "Successful Transitions"},
  {"term": "Liberalization", "definition": "The expansion of political freedoms (press freedom, assembly, association) within an authoritarian framework, which may or may not lead to full democratization.", "section": "018", "sectionName": "Successful Transitions"},
  {"term": "Civil Society", "definition": "The sphere of organized activity between the state and the family — NGOs, trade unions, professional associations, religious organizations, community groups — that provides the social infrastructure for democratic participation.", "section": "018", "sectionName": "Successful Transitions"},
  {"term": "Soft-Liner", "definition": "In transitions theory (O'Donnell and Schmitter), a member of the authoritarian regime who favors some degree of political opening, as opposed to 'hard-liners' who oppose any liberalization.", "section": "018", "sectionName": "Successful Transitions"},
  {"term": "Two-Turnover Test", "definition": "Samuel Huntington's criterion for democratic consolidation: a democracy is consolidated when the party in power loses an election and transfers power peacefully, and the new ruling party subsequently does the same.", "section": "018", "sectionName": "Successful Transitions"},

  {"term": "Failed State", "definition": "A state that can no longer perform the basic functions of sovereignty — maintaining a monopoly on violence, providing basic services, and controlling its territory — as occurred in Libya, Somalia, and parts of Syria and Yemen.", "section": "019", "sectionName": "Failed Transitions"},
  {"term": "Institutional Vacuum", "definition": "The condition that arises when old regime institutions are destroyed or collapse without new institutions being ready to replace them, creating a power vacuum that armed groups, militias, or external actors may fill.", "section": "019", "sectionName": "Failed Transitions"},
  {"term": "De-Baathification", "definition": "The US-led policy of removing all members of Iraq's Baath Party from government positions after 2003, which effectively dismantled the state bureaucracy and military, contributing to the insurgency. Used more broadly to describe purges of former regime members.", "section": "019", "sectionName": "Failed Transitions"},
  {"term": "Sectarian Capture", "definition": "When a transition process is dominated by one ethnic, religious, or sectarian group that uses the new political order to entrench its own power at the expense of other groups, as occurred in Iraq and to some extent in Egypt.", "section": "019", "sectionName": "Failed Transitions"},
  {"term": "Democratic Erosion", "definition": "The gradual dismantling of democratic institutions from within by elected leaders who use legal and constitutional mechanisms to concentrate power, suppress opposition, and eliminate checks and balances, as in Venezuela under Chavez/Maduro.", "section": "019", "sectionName": "Failed Transitions"},
  {"term": "Proxy War", "definition": "A conflict in which external powers support opposing sides within a country, using local actors as proxies for their own strategic objectives, as in Yemen (Saudi Arabia vs. Iran) and Syria (multiple external actors).", "section": "019", "sectionName": "Failed Transitions"},
  {"term": "Humanitarian Catastrophe", "definition": "A severe crisis in which large numbers of civilians face death, displacement, famine, or disease as a consequence of conflict or state collapse — the human cost of failed transitions.", "section": "019", "sectionName": "Failed Transitions"},
  {"term": "State-Building", "definition": "The process of constructing or reconstructing functioning state institutions — bureaucracy, judiciary, police, military, taxation system — in the aftermath of regime change or state collapse.", "section": "019", "sectionName": "Failed Transitions"},
  {"term": "Oligarchic Capture", "definition": "The process by which a small group of wealthy individuals gains control of economic and political resources during a transition, using privatization and institutional weakness to convert political access into permanent economic dominance, as in post-Soviet Russia.", "section": "019", "sectionName": "Failed Transitions"},
  {"term": "Competitive Authoritarianism", "definition": "A regime type in which democratic institutions formally exist — elections are held, opposition parties are legal — but the playing field is so tilted in favor of the incumbent that genuine alternation of power is effectively impossible, as in Venezuela and Russia.", "section": "019", "sectionName": "Failed Transitions"},
  {"term": "Responsibility to Protect (R2P)", "definition": "The international norm that the global community has a responsibility to intervene when a state fails to protect its population from mass atrocities, invoked in the Libya intervention but subsequently debated after the intervention's consequences.", "section": "019", "sectionName": "Failed Transitions"},
  {"term": "Muhasasa (Quota System)", "definition": "The sectarian and ethnic power-sharing quota system adopted in post-2003 Iraq, which allocated government positions along sectarian lines (Shia, Sunni, Kurdish), institutionalizing sectarian identity as the basis of political organization.", "section": "019", "sectionName": "Failed Transitions"},

  {"term": "Supply and Demand", "definition": "The fundamental market mechanism in which the quantity of a good that sellers offer (supply) and the quantity that buyers want (demand) interact to determine the market price and quantity exchanged.", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Inflation", "definition": "A sustained increase in the general price level of goods and services in an economy over time, reducing the purchasing power of money. Measured by indices such as the Consumer Price Index (CPI).", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Central Bank", "definition": "A nation's primary monetary authority, responsible for managing the money supply, setting interest rates, maintaining currency stability, and (in many countries) serving as lender of last resort to the banking system.", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Gross Domestic Product (GDP)", "definition": "The total monetary value of all finished goods and services produced within a country's borders in a specific time period, used as the primary measure of economic output.", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Comparative Advantage", "definition": "David Ricardo's principle that countries benefit from trade when each specializes in producing the goods for which it has the lowest opportunity cost, even if one country is more efficient at producing everything.", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Fiscal Policy", "definition": "Government decisions about taxation, spending, and borrowing used to influence the economy, as distinct from monetary policy (which is managed by the central bank).", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Human Capital", "definition": "The stock of knowledge, skills, health, and experience that individuals accumulate and that contributes to their economic productivity, a concept developed by economists Gary Becker and Theodore Schultz.", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Property Rights", "definition": "Legally recognized and enforced claims to use, benefit from, and transfer assets (land, goods, intellectual property), considered by institutional economists as the foundation of market economies.", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Gini Coefficient", "definition": "A statistical measure of income or wealth inequality within a population, ranging from 0 (perfect equality) to 1 (one person has everything), commonly used to compare inequality across countries and time.", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Dutch Disease", "definition": "The phenomenon in which a boom in natural resource exports (oil, gas, minerals) causes a country's currency to appreciate, making its other exports uncompetitive and hollowing out its manufacturing and agricultural sectors.", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Rent-Seeking", "definition": "Economic behavior aimed at gaining wealth not through productive activity but by manipulating the political or economic environment — obtaining subsidies, monopoly privileges, or government contracts through influence rather than efficiency.", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Market Failure", "definition": "Situations in which free markets fail to allocate resources efficiently, including externalities (pollution), public goods (national defense), monopolies, and information asymmetries.", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Purchasing Power Parity (PPP)", "definition": "A method of adjusting economic data to account for price differences between countries, allowing more accurate comparisons of living standards and economic output across nations.", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Institutional Economics", "definition": "The branch of economics, associated with Douglass North and Daron Acemoglu, that emphasizes the role of institutions — rules, norms, and enforcement mechanisms — in determining economic outcomes.", "section": "020", "sectionName": "How Economies Work"},
  {"term": "Resource Curse", "definition": "The paradox that countries with abundant natural resources (oil, minerals) often experience slower economic growth, more corruption, weaker institutions, and less democracy than resource-poor countries.", "section": "020", "sectionName": "How Economies Work"},

  {"term": "Dutch Disease", "definition": "An economic phenomenon where a country's natural resource wealth causes its currency to appreciate, making non-resource exports uncompetitive and hollowing out other sectors of the economy.", "section": "021", "sectionName": "Iran's Economy — Diagnosis"},
  {"term": "Rentier State", "definition": "A state that derives a substantial portion of its revenue from external rents (such as oil exports) rather than from domestic taxation, reducing its accountability to citizens.", "section": "021", "sectionName": "Iran's Economy — Diagnosis"},
  {"term": "Primary Sanctions", "definition": "Sanctions imposed directly on a target country's entities, prohibiting the sanctioning country's own nationals and companies from doing business with them.", "section": "021", "sectionName": "Iran's Economy — Diagnosis"},
  {"term": "Secondary Sanctions", "definition": "Sanctions that penalize third-party countries and companies for doing business with the sanctioned state, extending sanctions reach beyond the imposing country's own jurisdiction.", "section": "021", "sectionName": "Iran's Economy — Diagnosis"},
  {"term": "IRGC (Islamic Revolutionary Guard Corps)", "definition": "Iran's parallel military-political-economic institution that controls an estimated 20-40% of the formal economy through subsidiaries, bonyads, and no-bid contracts.", "section": "021", "sectionName": "Iran's Economy — Diagnosis"},
  {"term": "Bonyads", "definition": "Ostensibly charitable foundations in Iran that control vast economic assets, operate largely outside government budgets and oversight, and are typically connected to regime power centers.", "section": "021", "sectionName": "Iran's Economy — Diagnosis"},
  {"term": "Rial", "definition": "Iran's official currency, which has lost more than 90% of its value against the US dollar since 2011, with the gap between official and black market rates reflecting economic distortion.", "section": "021", "sectionName": "Iran's Economy — Diagnosis"},
  {"term": "Brain Drain (Human Capital Flight)", "definition": "The emigration of educated and skilled individuals from a country, estimated at 150,000-180,000 Iranians annually according to IMF data, representing a massive loss of economic productive capacity.", "section": "021", "sectionName": "Iran's Economy — Diagnosis"},
  {"term": "Underground Economy (Shadow Economy)", "definition": "Economic activity that occurs outside official measurement and taxation, estimated at 30-40% of Iran's GDP, encompassing informal trade, smuggling, and unlicensed enterprise.", "section": "021", "sectionName": "Iran's Economy — Diagnosis"},
  {"term": "Rent-Seeking", "definition": "The practice of manipulating public policy or economic conditions to obtain wealth through privileged access rather than through productive economic activity.", "section": "021", "sectionName": "Iran's Economy — Diagnosis"},
  {"term": "Resource Curse", "definition": "The paradox that countries rich in natural resources tend to have lower economic growth, less democracy, and more corruption than resource-poor countries.", "section": "021", "sectionName": "Iran's Economy — Diagnosis"},
  {"term": "Subsidy Reform", "definition": "Iran's ongoing effort to reduce massive energy and food subsidies (which at their peak consumed 25-30% of GDP), a politically explosive process attempted with mixed results since 2010.", "section": "021", "sectionName": "Iran's Economy — Diagnosis"},
  {"term": "SWIFT Disconnection", "definition": "The removal of Iranian banks from the Society for Worldwide Interbank Financial Telecommunication network, effectively cutting Iran off from the global financial system.", "section": "021", "sectionName": "Iran's Economy — Diagnosis"},

  {"term": "Shock Therapy", "definition": "A rapid, comprehensive approach to economic liberalization — simultaneous price decontrol, privatization, and trade opening — as implemented in Poland (1990) and Russia (1992), with dramatically different outcomes.", "section": "022", "sectionName": "Nation-Building Economics"},
  {"term": "Gradualism", "definition": "An incremental approach to economic reform that sequences liberalization measures over time to manage social disruption, as practiced in China's economic opening and South Korea's development.", "section": "022", "sectionName": "Nation-Building Economics"},
  {"term": "Sovereign Wealth Fund", "definition": "A state-owned investment fund that saves resource revenue for future generations and stabilizes the budget against commodity price swings, as in Norway's Government Pension Fund (valued at over $1.5 trillion).", "section": "022", "sectionName": "Nation-Building Economics"},
  {"term": "Voucher Privatization", "definition": "A method of transferring state-owned enterprises to citizens by distributing ownership vouchers, as attempted in Russia and the Czech Republic — with vastly different results depending on institutional safeguards.", "section": "022", "sectionName": "Nation-Building Economics"},
  {"term": "Washington Consensus", "definition": "A set of economic policy prescriptions — fiscal discipline, trade liberalization, privatization, deregulation — promoted by the IMF and World Bank in the 1990s, now widely criticized for ignoring institutional prerequisites.", "section": "022", "sectionName": "Nation-Building Economics"},
  {"term": "Currency Board", "definition": "A monetary arrangement that fixes the domestic currency to a foreign anchor currency with full reserve backing, used successfully in post-crisis stabilizations in Estonia, Bulgaria, and Argentina (until it failed there in 2001).", "section": "022", "sectionName": "Nation-Building Economics"},
  {"term": "Bilateral Investment Treaty (BIT)", "definition": "An agreement between two countries establishing terms and protections for private investment by nationals of one country in the other, typically including dispute resolution mechanisms.", "section": "022", "sectionName": "Nation-Building Economics"},
  {"term": "Institutional Sequencing", "definition": "The principle that the order in which reforms are implemented matters critically — establishing rule of law and property rights before privatization, for example, produces far better outcomes than the reverse.", "section": "022", "sectionName": "Nation-Building Economics"},
  {"term": "Dutch Disease Management", "definition": "Deliberate policy interventions to prevent natural resource revenue from destroying non-resource economic sectors, including sterilization of inflows, investment in diversification, and managed exchange rates.", "section": "022", "sectionName": "Nation-Building Economics"},
  {"term": "Lustration (Economic)", "definition": "The process of reviewing and potentially barring former regime officials and their economic networks from participating in post-transition privatization and economic governance.", "section": "022", "sectionName": "Nation-Building Economics"},
  {"term": "Brain Gain", "definition": "The return of skilled emigrants to their home country following improved political and economic conditions, reversing brain drain — as occurred in South Korea, Taiwan, Ireland, and India.", "section": "022", "sectionName": "Nation-Building Economics"},
  {"term": "Import Substitution vs. Export Orientation", "definition": "Two contrasting development strategies: producing domestically what was previously imported (ISI, common in 1960s-70s) versus building competitive export industries (the East Asian model that produced faster growth).", "section": "022", "sectionName": "Nation-Building Economics"},
  {"term": "Special Economic Zone (SEZ)", "definition": "A geographically designated area with different economic regulations than the rest of the country — reduced taxes, streamlined customs, fewer restrictions — used to attract investment and test reforms, as in China's Shenzhen.", "section": "022", "sectionName": "Nation-Building Economics"},

  {"term": "Argument", "definition": "In logic, a structured set of statements where one or more premises (pieces of evidence or reasoning) are offered in support of a conclusion — not a quarrel, but a reasoned case for a claim.", "section": "023", "sectionName": "Critical Thinking & Logic"},
  {"term": "Premise", "definition": "A statement offered as evidence or reasoning in support of a conclusion; the building blocks of an argument that, if true and properly connected, make the conclusion reasonable to accept.", "section": "023", "sectionName": "Critical Thinking & Logic"},
  {"term": "Validity", "definition": "A property of deductive arguments where the conclusion necessarily follows from the premises — if the premises are true, the conclusion must be true. An argument can be valid even if its premises are false.", "section": "023", "sectionName": "Critical Thinking & Logic"},
  {"term": "Soundness", "definition": "A property of deductive arguments that are both valid (the logic works) and have true premises — a sound argument is one where the conclusion is actually established, not merely logically consistent.", "section": "023", "sectionName": "Critical Thinking & Logic"},
  {"term": "Informal Fallacy", "definition": "An error in reasoning that is not a structural logical error but rather a flaw in the relevance, sufficiency, or acceptability of the premises — often persuasive despite being logically deficient.", "section": "023", "sectionName": "Critical Thinking & Logic"},
  {"term": "Ad Hominem", "definition": "A fallacy that attacks the person making an argument rather than the argument itself — 'He's a monarchist, so his economic analysis is wrong' is ad hominem because political identity does not determine the validity of economic reasoning.", "section": "023", "sectionName": "Critical Thinking & Logic"},
  {"term": "Straw Man", "definition": "A fallacy that misrepresents an opponent's position to make it easier to attack — responding to 'we should reform the judiciary' with 'they want to destroy all Islamic values' is a straw man.", "section": "023", "sectionName": "Critical Thinking & Logic"},
  {"term": "False Dilemma", "definition": "A fallacy that presents only two options when more exist — 'either you support the regime or you support foreign intervention' ignores numerous intermediate positions.", "section": "023", "sectionName": "Critical Thinking & Logic"},
  {"term": "Confirmation Bias", "definition": "The tendency to seek out, interpret, and remember information that confirms one's pre-existing beliefs while ignoring or discounting contradictory evidence.", "section": "023", "sectionName": "Critical Thinking & Logic"},
  {"term": "Cognitive Bias", "definition": "A systematic pattern of deviation from rational judgment, arising from the brain's use of mental shortcuts (heuristics) that work well in many situations but produce predictable errors in others.", "section": "023", "sectionName": "Critical Thinking & Logic"},
  {"term": "Motivated Reasoning", "definition": "The unconscious tendency to process information in a way that supports conclusions one wants to reach, treating favored positions with lower standards of evidence and opposing positions with higher standards.", "section": "023", "sectionName": "Critical Thinking & Logic"},
  {"term": "Correlation vs. Causation", "definition": "The distinction between two things occurring together (correlation) and one thing actually causing the other (causation) — a critical distinction because most correlations are not causal.", "section": "023", "sectionName": "Critical Thinking & Logic"},
  {"term": "Base Rate Neglect", "definition": "The cognitive error of ignoring the overall frequency of an event (the base rate) when evaluating a specific case, leading to dramatic overestimation of rare events.", "section": "023", "sectionName": "Critical Thinking & Logic"},
  {"term": "Burden of Proof", "definition": "The obligation to provide evidence for a claim rests on the person making the claim — extraordinary claims require extraordinary evidence, and the absence of disproof does not constitute proof.", "section": "023", "sectionName": "Critical Thinking & Logic"},

  {"term": "Propaganda", "definition": "The deliberate, systematic effort to shape perceptions, manipulate cognitions, and direct behavior to achieve a response that furthers the desired intent of the propagandist — distinguished from education by its prioritization of persuasion over accuracy.", "section": "024", "sectionName": "Media Literacy & Propaganda"},
  {"term": "Disinformation", "definition": "False information that is deliberately created and spread with the intent to deceive — distinguished from misinformation, which is false information spread without intent to deceive.", "section": "024", "sectionName": "Media Literacy & Propaganda"},
  {"term": "Misinformation", "definition": "False or inaccurate information spread without deliberate intent to deceive, often through honest error, poor sourcing, or uncritical sharing of unverified claims.", "section": "024", "sectionName": "Media Literacy & Propaganda"},
  {"term": "Framing", "definition": "The way information is presented — which facts are included or excluded, what language is used, what context is provided — that shapes how audiences interpret events without necessarily stating anything false.", "section": "024", "sectionName": "Media Literacy & Propaganda"},
  {"term": "Astroturfing", "definition": "The practice of masking the sponsors of a message to make it appear as though it originates from and is supported by grassroots participants — creating the appearance of popular support where it does not organically exist.", "section": "024", "sectionName": "Media Literacy & Propaganda"},
  {"term": "Information Laundering", "definition": "The process of passing false or misleading information through increasingly credible outlets until it appears legitimate — a fringe claim picked up by a marginal outlet, then cited by a mainstream one.", "section": "024", "sectionName": "Media Literacy & Propaganda"},
  {"term": "Whataboutism", "definition": "A propaganda technique that responds to criticism by pointing to alleged hypocrisy or wrongdoing by the critic, deflecting attention from the original issue without addressing it — extensively used by both Iranian regime and opposition discourse.", "section": "024", "sectionName": "Media Literacy & Propaganda"},
  {"term": "Atrocity Propaganda", "definition": "The deliberate exaggeration or fabrication of enemy atrocities to dehumanize opponents and justify one's own cause — present in all armed conflicts and political struggles, including Iranian political discourse.", "section": "024", "sectionName": "Media Literacy & Propaganda"},
  {"term": "OSINT (Open Source Intelligence)", "definition": "Intelligence derived from publicly available information — satellite imagery, social media posts, public records, news reports — used by journalists and researchers to verify or debunk claims independently.", "section": "024", "sectionName": "Media Literacy & Propaganda"},
  {"term": "Reverse Image Search", "definition": "A digital verification technique that searches for previous appearances of an image online, used to detect recycled photos, manipulated images, and misattributed visual content.", "section": "024", "sectionName": "Media Literacy & Propaganda"},
  {"term": "Narrative Warfare", "definition": "The deliberate construction and promotion of competing stories about events, history, and identity to shape political attitudes and behaviors — the 'battle of narratives' that characterizes Iranian politics.", "section": "024", "sectionName": "Media Literacy & Propaganda"},
  {"term": "Filter Bubble", "definition": "The intellectual isolation that occurs when algorithmic curation and self-selection create information environments where users encounter only perspectives that reinforce their existing beliefs.", "section": "024", "sectionName": "Media Literacy & Propaganda"},
  {"term": "Source Triangulation", "definition": "The practice of verifying a claim by checking it against at least three independent sources from different perspectives, institutional types, or geographic locations.", "section": "024", "sectionName": "Media Literacy & Propaganda"},

  {"term": "Natural Rights", "definition": "The philosophical position that certain rights belong to all human beings by virtue of their humanity, prior to and independent of any government or legal system — associated with Locke, the American Declaration of Independence, and the French Declaration of the Rights of Man.", "section": "025", "sectionName": "Law, Rights & Justice"},
  {"term": "Legal Positivism", "definition": "The philosophical position that rights exist only insofar as they are enacted into law by a legitimate authority — there are no rights 'in nature,' only rights that legal systems create, recognize, and enforce.", "section": "025", "sectionName": "Law, Rights & Justice"},
  {"term": "Universal Declaration of Human Rights (UDHR)", "definition": "Adopted by the UN General Assembly on December 10, 1948, with Iran voting in favor, this non-binding declaration established 30 articles of fundamental rights and freedoms that have become the foundation of international human rights law.", "section": "025", "sectionName": "Law, Rights & Justice"},
  {"term": "ICCPR (International Covenant on Civil and Political Rights)", "definition": "A binding international treaty (1966, entered into force 1976) obligating signatory states — including Iran — to respect civil and political rights including freedom of expression, assembly, and due process.", "section": "025", "sectionName": "Law, Rights & Justice"},
  {"term": "ICESCR (International Covenant on Economic, Social, and Cultural Rights)", "definition": "A binding international treaty (1966) obligating states to progressively realize economic and social rights including education, health, adequate standard of living, and work — Iran is a signatory.", "section": "025", "sectionName": "Law, Rights & Justice"},
  {"term": "Rule of Law", "definition": "The principle that all persons, institutions, and entities — including the state itself — are accountable to laws that are publicly promulgated, equally enforced, and independently adjudicated, as distinguished from rule by law (using law as a tool of state power).", "section": "025", "sectionName": "Law, Rights & Justice"},
  {"term": "Judicial Independence", "definition": "The principle that judges must be free from interference by the executive, legislative, and military branches of government, as well as from religious authorities, in order to adjudicate cases based solely on law and evidence.", "section": "025", "sectionName": "Law, Rights & Justice"},
  {"term": "Transitional Justice", "definition": "The set of judicial and non-judicial measures implemented by societies transitioning from conflict or authoritarian rule to address large-scale human rights abuses, including criminal prosecution, truth-telling, reparations, and institutional reform.", "section": "025", "sectionName": "Law, Rights & Justice"},
  {"term": "Truth Commission", "definition": "An officially sanctioned, temporary, non-judicial body that investigates a pattern of past human rights abuses, produces a public report, and may recommend reforms and reparations — as in South Africa's Truth and Reconciliation Commission (1996-1998).", "section": "025", "sectionName": "Law, Rights & Justice"},
  {"term": "Lustration", "definition": "The practice of screening and potentially barring individuals who held positions in an authoritarian regime from holding public office in the successor state — implemented in varying forms across post-communist Central and Eastern Europe.", "section": "025", "sectionName": "Law, Rights & Justice"},
  {"term": "Cultural Relativism (in human rights)", "definition": "The argument that human rights standards reflect Western values and cannot be universally applied — a position advanced by some governments (including Iran's) to resist international human rights scrutiny, and contested by human rights scholars and many activists within those societies.", "section": "025", "sectionName": "Law, Rights & Justice"},
  {"term": "Due Process", "definition": "The legal requirement that the state must respect all legal rights owed to a person, including fair notice, the right to be heard, the right to counsel, protection against self-incrimination, and the right to appeal — absent in many Iranian judicial proceedings.", "section": "025", "sectionName": "Law, Rights & Justice"},
  {"term": "Impunity", "definition": "The absence of legal consequences for human rights violations, which both fails to provide justice for victims and creates incentives for future violations — a central feature of Iran's current system.", "section": "025", "sectionName": "Law, Rights & Justice"},
  {"term": "Reparations", "definition": "Measures taken to redress human rights violations, which may include compensation, restitution, rehabilitation, satisfaction (official acknowledgment), and guarantees of non-repetition.", "section": "025", "sectionName": "Law, Rights & Justice"},

  {"term": "Axis of Resistance (Mehvar-e Moqavemat)", "definition": "Iran's network of allied non-state actors and governments opposed to US and Israeli influence in the Middle East, including Hezbollah, Hamas, Palestinian Islamic Jihad, Houthi Ansar Allah, and Iraqi Popular Mobilization Forces.", "section": "026", "sectionName": "Iran in Geopolitics"},
  {"term": "JCPOA (Joint Comprehensive Plan of Action)", "definition": "The 2015 multilateral nuclear agreement between Iran and the P5+1 (US, UK, France, Russia, China, Germany) that limited Iran's nuclear enrichment in exchange for sanctions relief; the US withdrew in 2018.", "section": "026", "sectionName": "Iran in Geopolitics"},
  {"term": "Maximum Pressure", "definition": "The Trump administration's policy (2018-2021) of reimposing and expanding sanctions on Iran after withdrawing from the JCPOA, aiming to compel renegotiation or regime change.", "section": "026", "sectionName": "Iran in Geopolitics"},
  {"term": "Strategic Depth", "definition": "In geopolitical theory, the geographic and political capacity of a state to absorb attacks and project power; Iran's proxy network provides strategic depth beyond its borders.", "section": "026", "sectionName": "Iran in Geopolitics"},
  {"term": "Uranium Enrichment", "definition": "The process of increasing the proportion of the fissile isotope U-235 in uranium; enrichment to 3-5% is fuel-grade, 20% is highly enriched, and 90%+ is weapons-grade.", "section": "026", "sectionName": "Iran in Geopolitics"},
  {"term": "Sanctions (Primary and Secondary)", "definition": "Primary sanctions prohibit a country's own citizens/companies from dealing with a target; secondary sanctions penalize third-country entities for doing business with the sanctioned state.", "section": "026", "sectionName": "Iran in Geopolitics"},
  {"term": "Proxy Warfare", "definition": "The use of non-state armed groups or allied states to advance strategic objectives without direct military engagement, a central feature of Iran's regional strategy.", "section": "026", "sectionName": "Iran in Geopolitics"},
  {"term": "Strait of Hormuz", "definition": "The narrow waterway between Iran and Oman through which approximately 20-25% of global oil supply transits; Iran's geographic control of its northern shore is a key strategic asset.", "section": "026", "sectionName": "Iran in Geopolitics"},
  {"term": "Look East Policy", "definition": "Iran's strategic pivot toward China and Russia as Western sanctions constrained its economic and diplomatic options, formalized through agreements like the Iran-China 25-year cooperation pact (2021).", "section": "026", "sectionName": "Iran in Geopolitics"},
  {"term": "Regional Security Complex", "definition": "Barry Buzan's concept describing a group of states whose security concerns are so closely linked that their national security problems cannot be analyzed apart from one another; the Persian Gulf constitutes one such complex.", "section": "026", "sectionName": "Iran in Geopolitics"},
  {"term": "Nuclear Latency (Breakout Capability)", "definition": "The technical capacity to produce weapons-grade fissile material in a short timeframe without having yet assembled a weapon; Iran's enrichment advances have significantly reduced its estimated breakout time.", "section": "026", "sectionName": "Iran in Geopolitics"},
  {"term": "Quds Force", "definition": "The extraterritorial operations branch of the IRGC responsible for managing Iran's relationships with proxy forces and conducting operations abroad, commanded by Qasem Soleimani until his assassination in January 2020.", "section": "026", "sectionName": "Iran in Geopolitics"},
  {"term": "Comprehensive Strategic Partnership", "definition": "The framework for Iran-China relations signed in 2021, reportedly involving $400 billion in Chinese investment over 25 years in exchange for discounted oil, though implementation details remain opaque.", "section": "026", "sectionName": "Iran in Geopolitics"},

  {"term": "Diaspora", "definition": "A population dispersed from its original homeland that maintains identity, connections, and (often) political engagement with the homeland; from Greek 'diaspeirein' (to scatter).", "section": "027", "sectionName": "The Diaspora's Role"},
  {"term": "Brain Drain (Faraar-e Maghzha)", "definition": "The emigration of highly educated and skilled individuals from a country, resulting in loss of human capital; Iran ranks among the highest globally in brain drain rates, with an estimated annual cost of $150 billion according to some Iranian officials.", "section": "027", "sectionName": "The Diaspora's Role"},
  {"term": "Remittances", "definition": "Money sent by emigrants back to their home country; Iranian diaspora remittances are difficult to quantify due to sanctions but estimated at several billion dollars annually through informal channels.", "section": "027", "sectionName": "The Diaspora's Role"},
  {"term": "Diaspora Politics", "definition": "Political activity by emigrant communities aimed at influencing conditions in their homeland, ranging from lobbying host-country governments to funding opposition movements to cultural advocacy.", "section": "027", "sectionName": "The Diaspora's Role"},
  {"term": "Transnationalism", "definition": "The maintenance of social, economic, political, and cultural connections across national borders by migrant communities, enabled by modern communication and travel technology.", "section": "027", "sectionName": "The Diaspora's Role"},
  {"term": "Assimilation vs. Integration", "definition": "Assimilation involves adopting the host country's culture while shedding the original identity; integration involves participating in the host society while maintaining distinct cultural identity — most Iranian diaspora communities pursue integration.", "section": "027", "sectionName": "The Diaspora's Role"},
  {"term": "Generational Shift", "definition": "The change in attitudes, identity, and political engagement between first-generation emigrants (who experienced Iran directly) and second/third generations (who know Iran primarily through family narratives and media).", "section": "027", "sectionName": "The Diaspora's Role"},
  {"term": "Tehrangeles", "definition": "The colloquial term for the large Iranian community in Los Angeles, California — estimated at 500,000-700,000, the largest concentration of Iranians outside Iran.", "section": "027", "sectionName": "The Diaspora's Role"},
  {"term": "Long-Distance Nationalism", "definition": "Benedict Anderson's concept describing political engagement with the homeland by diaspora populations who are not subject to the consequences of the politics they advocate.", "section": "027", "sectionName": "The Diaspora's Role"},
  {"term": "NIAC (National Iranian American Council)", "definition": "The largest Iranian-American advocacy organization, focused on US-Iran diplomacy and Iranian-American civil rights; controversial within the diaspora, with critics alleging proximity to the regime and supporters defending its diplomatic engagement approach.", "section": "027", "sectionName": "The Diaspora's Role"},
  {"term": "Hawala", "definition": "An informal value transfer system used across the Middle East and South Asia, commonly used by Iranian diaspora to send money to Iran circumventing sanctions-related banking restrictions.", "section": "027", "sectionName": "The Diaspora's Role"},
  {"term": "Diaspora Philanthropy", "definition": "Charitable giving by emigrant communities directed at their homeland, including funding for education, health, disaster relief, and civil society development.", "section": "027", "sectionName": "The Diaspora's Role"},

  {"term": "Civil Society", "definition": "The sphere of voluntary associations, organizations, and institutions that operate independently of both the state and the market — including NGOs, unions, professional associations, religious organizations, and community groups.", "section": "028", "sectionName": "Civic Participation & Organization"},
  {"term": "Nonviolent Resistance", "definition": "The practice of using non-military methods — protests, strikes, boycotts, civil disobedience, non-cooperation — to achieve political objectives; Gene Sharp identified 198 distinct methods.", "section": "028", "sectionName": "Civic Participation & Organization"},
  {"term": "Collective Action Problem", "definition": "The challenge of coordinating group behavior when individuals have incentives to free-ride on others' efforts; a central obstacle in civic organizing, especially under authoritarian conditions where participation carries personal risk.", "section": "028", "sectionName": "Civic Participation & Organization"},
  {"term": "Social Capital", "definition": "Robert Putnam's concept referring to the networks of relationships, norms of reciprocity, and trust that enable collective action; the 'connective tissue' of civil society.", "section": "028", "sectionName": "Civic Participation & Organization"},
  {"term": "Pillars of Support", "definition": "Gene Sharp's framework identifying the key institutions (military, police, civil service, business, religious authorities, media) whose cooperation an authoritarian regime requires to function; nonviolent strategy targets these pillars.", "section": "028", "sectionName": "Civic Participation & Organization"},
  {"term": "Parallel Institutions", "definition": "Alternative civic structures built by opposition movements to provide governance functions (dispute resolution, education, social services) outside the authoritarian state, creating the embryo of a post-transition society.", "section": "028", "sectionName": "Civic Participation & Organization"},
  {"term": "Professional Association", "definition": "An organization of practitioners in a specific profession (lawyers, doctors, engineers, journalists) that can serve as a vehicle for collective action, credibility, and institutional continuity during transitions.", "section": "028", "sectionName": "Civic Participation & Organization"},
  {"term": "Trade Union", "definition": "An organization of workers formed to protect and advance their collective interests through bargaining, strikes, and political advocacy; labor movements have been central to democratic transitions in Poland, South Korea, South Africa, and elsewhere.", "section": "028", "sectionName": "Civic Participation & Organization"},
  {"term": "Civic Education", "definition": "The process of teaching citizens the knowledge, skills, and dispositions necessary for effective participation in democratic governance — a function that civil society organizations often fill in pre-transition environments.", "section": "028", "sectionName": "Civic Participation & Organization"},
  {"term": "Local Governance", "definition": "Municipal and community-level decision-making structures — city councils, neighborhood associations, cooperative boards — that serve as the practical training ground for democratic participation.", "section": "028", "sectionName": "Civic Participation & Organization"},
  {"term": "Solidarity Economy", "definition": "Economic activities organized around cooperation and mutual aid rather than profit maximization — cooperatives, credit unions, mutual aid societies — that can sustain civic movements and prefigure post-transition economic institutions.", "section": "028", "sectionName": "Civic Participation & Organization"},
  {"term": "International Solidarity", "definition": "Support from foreign governments, NGOs, diaspora communities, and transnational advocacy networks for domestic civic movements, including funding, diplomatic pressure, training, technical assistance, and moral support.", "section": "028", "sectionName": "Civic Participation & Organization"},

  {"term": "Ethics (Akhlaq)", "definition": "The systematic study of right and wrong action, moral principles, and the good life; from Greek 'ethos' (character) and Arabic 'akhlaq' (morals, character traits).", "section": "029", "sectionName": "Ethics & Moral Reasoning"},
  {"term": "Virtue Ethics", "definition": "The ethical framework originating with Aristotle that focuses on developing good character traits (virtues) rather than following rules or calculating consequences; the central question is 'What kind of person should I be?'", "section": "029", "sectionName": "Ethics & Moral Reasoning"},
  {"term": "Eudaimonia", "definition": "Aristotle's concept of human flourishing or 'living well and doing well'; not merely happiness as a feeling, but the realization of human potential through virtuous activity — the ultimate aim of ethics.", "section": "029", "sectionName": "Ethics & Moral Reasoning"},
  {"term": "Deontology", "definition": "The ethical framework associated with Kant that focuses on duties and rules; actions are right or wrong based on whether they conform to moral duties, regardless of their consequences.", "section": "029", "sectionName": "Ethics & Moral Reasoning"},
  {"term": "Categorical Imperative", "definition": "Kant's supreme principle of morality: 'Act only according to that maxim by which you can at the same time will that it should become a universal law'; a test for whether an action is morally permissible.", "section": "029", "sectionName": "Ethics & Moral Reasoning"},
  {"term": "Consequentialism", "definition": "The ethical framework that judges actions solely by their outcomes; an action is right if it produces the best overall consequences (most happiness, least suffering).", "section": "029", "sectionName": "Ethics & Moral Reasoning"},
  {"term": "Utilitarianism", "definition": "The most influential form of consequentialism, developed by Jeremy Bentham and John Stuart Mill, holding that the right action is the one that produces the greatest happiness for the greatest number.", "section": "029", "sectionName": "Ethics & Moral Reasoning"},
  {"term": "Maqasid al-Shariah", "definition": "The 'objectives of Islamic law' — the higher purposes that Sharia aims to protect: life (nafs), religion (din), intellect (aql), lineage (nasl), and property (mal); a framework for moral reasoning within Islamic ethics.", "section": "029", "sectionName": "Ethics & Moral Reasoning"},
  {"term": "Just War Theory", "definition": "The philosophical tradition, developed by Augustine, Aquinas, and modern theorists, that specifies conditions under which war (or armed resistance) is morally justified (jus ad bellum) and how it must be conducted (jus in bello).", "section": "029", "sectionName": "Ethics & Moral Reasoning"},
  {"term": "Moral Dilemma", "definition": "A situation in which every available course of action involves a moral cost — there is no option that is entirely free of wrongdoing; political life, especially during transitions, generates such dilemmas constantly.", "section": "029", "sectionName": "Ethics & Moral Reasoning"},
  {"term": "Restorative Justice", "definition": "An approach to justice that focuses on repairing harm and restoring relationships rather than punishing offenders; emphasizes dialogue, accountability, and healing — exemplified by South Africa's Truth and Reconciliation Commission.", "section": "029", "sectionName": "Ethics & Moral Reasoning"},
  {"term": "Means and Ends", "definition": "The ethical relationship between the methods used (means) and the goals pursued (ends); the central question: does a good end justify morally questionable means? Different ethical frameworks answer differently.", "section": "029", "sectionName": "Ethics & Moral Reasoning"},
  {"term": "Moral Agency", "definition": "The capacity to make moral judgments and be held responsible for one's actions; a concept relevant to questions about collective responsibility, complicity, and the moral status of actions taken under coercion.", "section": "029", "sectionName": "Ethics & Moral Reasoning"},
  {"term": "Care Ethics", "definition": "The ethical framework developed by Carol Gilligan and Nel Noddings that emphasizes relationships, responsibilities, and empathy as the foundation of morality, offering an alternative to rule-based and consequence-based approaches.", "section": "029", "sectionName": "Ethics & Moral Reasoning"},

  {"term": "Freedom (Azadi)", "definition": "The condition of being able to act, think, and live according to one's own will without unjust external constraint; 'azadi' in Persian carries profound political resonance as a rallying cry across Iranian political movements.", "section": "030", "sectionName": "Philosophy of Freedom & Human Flourishing"},
  {"term": "Eudaimonia", "definition": "Aristotle's concept of human flourishing — not mere subjective happiness but the objective realization of human potential through virtuous activity in a well-ordered community; the purpose of politics is to create conditions for eudaimonia.", "section": "030", "sectionName": "Philosophy of Freedom & Human Flourishing"},
  {"term": "Negative Liberty", "definition": "Isaiah Berlin's term for freedom understood as the absence of external interference — 'freedom from' coercion, constraint, and domination by others or by the state.", "section": "030", "sectionName": "Philosophy of Freedom & Human Flourishing"},
  {"term": "Positive Liberty", "definition": "Isaiah Berlin's term for freedom understood as the capacity for self-realization and self-mastery — 'freedom to' live a full, autonomous, self-directed life; a concept Berlin warned could be misused to justify paternalism.", "section": "030", "sectionName": "Philosophy of Freedom & Human Flourishing"},
  {"term": "Capability Approach", "definition": "Amartya Sen and Martha Nussbaum's framework that defines well-being not by income or subjective happiness but by the real freedoms (capabilities) people have to live lives they value — including health, education, political participation, and bodily integrity.", "section": "030", "sectionName": "Philosophy of Freedom & Human Flourishing"},
  {"term": "Central Capabilities", "definition": "Nussbaum's list of ten fundamental human capabilities that every just society must guarantee: life; bodily health; bodily integrity; senses, imagination, and thought; emotions; practical reason; affiliation; relation to nature; play; and control over one's environment.", "section": "030", "sectionName": "Philosophy of Freedom & Human Flourishing"},
  {"term": "Laicite", "definition": "The French model of strict secularism that separates religion from public institutions and confines religious practice to the private sphere; one end of the spectrum of religion-state arrangements.", "section": "030", "sectionName": "Philosophy of Freedom & Human Flourishing"},
  {"term": "Pluralism", "definition": "The philosophical and political commitment to acknowledging and accommodating multiple valid ways of life, beliefs, and identities within a single society; Berlin's 'value pluralism' holds that genuine human goods are multiple and sometimes incompatible.", "section": "030", "sectionName": "Philosophy of Freedom & Human Flourishing"},
  {"term": "Autonomy", "definition": "The capacity and right of individuals to govern themselves — to make their own choices based on their own reasoning; a central concept in both liberal political philosophy and Kantian ethics.", "section": "030", "sectionName": "Philosophy of Freedom & Human Flourishing"},
  {"term": "Welfare State", "definition": "A government system in which the state provides a social safety net — health care, education, unemployment insurance, pensions — to ensure a minimum standard of living; debated as either an enabler of positive liberty or a constraint on economic freedom.", "section": "030", "sectionName": "Philosophy of Freedom & Human Flourishing"},
  {"term": "Self-Determination", "definition": "The principle that peoples have the right to determine their own political status and form of government; applies both to nations (national self-determination) and to individuals (personal autonomy).", "section": "030", "sectionName": "Philosophy of Freedom & Human Flourishing"},
  {"term": "Human Development Index (HDI)", "definition": "The UN's composite measure of national well-being incorporating life expectancy, education, and per-capita income; influenced by Sen's capability approach; Iran's HDI has shown gains in health and literacy despite political unfreedom.", "section": "030", "sectionName": "Philosophy of Freedom & Human Flourishing"},
  {"term": "Republicanism (Political Philosophy)", "definition": "The political philosophy — distinct from the American political party — that defines freedom as non-domination: being free means not being subject to the arbitrary will of another, even if they choose not to exercise it (Philip Pettit).", "section": "030", "sectionName": "Philosophy of Freedom & Human Flourishing"},

  {"term": "Day After Problem", "definition": "The challenge of maintaining state functions and public order in the immediate aftermath of regime collapse, when old institutions have lost authority but new ones have not yet been established.", "section": "031", "sectionName": "The Day After — Crisis, Transition, and the First Year"},
  {"term": "Security Vacuum", "definition": "The period between the collapse of old security structures and the establishment of new ones, during which armed groups, criminal networks, and score-settling can produce catastrophic violence.", "section": "031", "sectionName": "The Day After — Crisis, Transition, and the First Year"},
  {"term": "Governance Continuity", "definition": "The principle that basic state functions (utilities, healthcare, education, administration) must continue operating regardless of political change at the top.", "section": "031", "sectionName": "The Day After — Crisis, Transition, and the First Year"},
  {"term": "Sanctions Relief Sequencing", "definition": "The phased process of removing international sanctions, which involves legal, financial, and political steps that typically take months to years even after political conditions are met.", "section": "031", "sectionName": "The Day After — Crisis, Transition, and the First Year"},
  {"term": "Transitional Justice", "definition": "The set of judicial and non-judicial measures implemented to address the legacy of large-scale human rights abuses, including prosecutions, truth commissions, reparations, and institutional reform.", "section": "031", "sectionName": "The Day After — Crisis, Transition, and the First Year"},
  {"term": "Constitutional Moment", "definition": "A rare period of political openness when fundamental rules of governance can be rewritten, typically lasting 18-36 months before political consolidation narrows the window.", "section": "031", "sectionName": "The Day After — Crisis, Transition, and the First Year"},
  {"term": "Path Dependency", "definition": "The phenomenon whereby early decisions in a transition constrain later options, making the first months disproportionately consequential for long-term outcomes.", "section": "031", "sectionName": "The Day After — Crisis, Transition, and the First Year"},
  {"term": "Spoiler", "definition": "An actor who uses violence or obstruction to undermine a transition because they calculate that the new order will be worse for their interests than continued conflict.", "section": "031", "sectionName": "The Day After — Crisis, Transition, and the First Year"},
  {"term": "Pacted Transition", "definition": "A negotiated transfer of power in which outgoing elites receive security guarantees in exchange for ceding political control, as in Spain (1975-78) and South Africa (1990-94).", "section": "031", "sectionName": "The Day After — Crisis, Transition, and the First Year"},
  {"term": "De-Ba'athification Lesson", "definition": "The cautionary precedent from Iraq (2003) where wholesale purging of the ruling party's members from state institutions destroyed administrative capacity and fueled insurgency.", "section": "031", "sectionName": "The Day After — Crisis, Transition, and the First Year"},

  {"term": "Shock Therapy vs. Gradualism", "definition": "The debate over whether post-authoritarian economic reform should be implemented rapidly (Poland's Big Bang) or incrementally (China's dual-track approach), with extensive evidence on both sides.", "section": "032", "sectionName": "Building the New State — Reconstruction and Reform"},
  {"term": "Resource Curse", "definition": "The paradox that countries rich in natural resources (especially oil) tend to have slower economic growth, weaker institutions, and more authoritarian governance than resource-poor countries.", "section": "032", "sectionName": "Building the New State — Reconstruction and Reform"},
  {"term": "Sovereign Wealth Fund", "definition": "A state-owned investment fund that converts resource revenues into diversified financial assets, designed to stabilize the economy and preserve wealth for future generations (e.g., Norway's GPFG).", "section": "032", "sectionName": "Building the New State — Reconstruction and Reform"},
  {"term": "Security Sector Reform (SSR)", "definition": "The transformation of a country's security institutions (military, police, intelligence) to operate under democratic governance, rule of law, and civilian oversight.", "section": "032", "sectionName": "Building the New State — Reconstruction and Reform"},
  {"term": "Human Capital Flight", "definition": "The emigration of educated and skilled workers, which depletes a country's productive capacity — Iran loses an estimated 150,000-180,000 educated citizens annually.", "section": "032", "sectionName": "Building the New State — Reconstruction and Reform"},
  {"term": "Sub-Replacement Fertility", "definition": "A total fertility rate below 2.1 children per woman, meaning the population will shrink without immigration — Iran's rate of 1.7 represents a demographic crisis requiring policy response.", "section": "032", "sectionName": "Building the New State — Reconstruction and Reform"},
  {"term": "Dutch Disease", "definition": "The phenomenon where natural resource revenues strengthen the national currency, making non-resource exports uncompetitive and hollowing out the manufacturing sector.", "section": "032", "sectionName": "Building the New State — Reconstruction and Reform"},
  {"term": "Lustration", "definition": "The process of vetting public officials for their involvement with the former authoritarian regime, ranging from disclosure requirements to employment bans.", "section": "032", "sectionName": "Building the New State — Reconstruction and Reform"},
  {"term": "Asymmetric Federalism", "definition": "A federal system in which different sub-national units have different levels of autonomy, designed to accommodate regions with distinct ethnic, linguistic, or cultural identities.", "section": "032", "sectionName": "Building the New State — Reconstruction and Reform"},
  {"term": "Sequencing", "definition": "The order in which reforms are implemented, which the evidence shows is often more important than the specific content of reforms — getting the sequence wrong can be catastrophic.", "section": "032", "sectionName": "Building the New State — Reconstruction and Reform"},

  {"term": "Democratic Consolidation", "definition": "The process by which a new democracy becomes stable enough that all major political actors accept democratic rules as 'the only game in town' — typically requiring two peaceful transfers of power.", "section": "033", "sectionName": "The Long Game — Principles for Sustained Flourishing"},
  {"term": "Democratic Backslide", "definition": "The gradual erosion of democratic institutions and norms by elected leaders who use legal means to concentrate power, weaken checks, and undermine opposition — the primary threat to new democracies.", "section": "033", "sectionName": "The Long Game — Principles for Sustained Flourishing"},
  {"term": "Hybrid Regime", "definition": "A political system that combines democratic elements (elections, some civil liberties) with authoritarian practices (media control, judicial manipulation) — the most common outcome of incomplete transitions.", "section": "033", "sectionName": "The Long Game — Principles for Sustained Flourishing"},
  {"term": "Consociationalism", "definition": "A power-sharing system designed for deeply divided societies, featuring grand coalitions, mutual vetoes, proportional representation, and group autonomy — as in Lebanon, Belgium, and Bosnia.", "section": "033", "sectionName": "The Long Game — Principles for Sustained Flourishing"},
  {"term": "Centripetal Democracy", "definition": "An alternative to consociationalism that uses institutional design to encourage cross-ethnic coalition-building and moderate politics, rather than entrenching group divisions.", "section": "033", "sectionName": "The Long Game — Principles for Sustained Flourishing"},
  {"term": "Soft Power", "definition": "The ability to attract and influence others through culture, values, and foreign policy legitimacy rather than through military force or economic coercion.", "section": "033", "sectionName": "The Long Game — Principles for Sustained Flourishing"},
  {"term": "Middle-Income Trap", "definition": "The phenomenon where rapidly growing economies stall at middle-income levels, unable to compete with either low-wage economies or high-innovation economies — a key risk for post-transition Iran.", "section": "033", "sectionName": "The Long Game — Principles for Sustained Flourishing"},
  {"term": "Two-Turnover Test", "definition": "Huntington's criterion for democratic consolidation: democracy is consolidated when power has transferred peacefully between competing parties at least twice through free elections.", "section": "033", "sectionName": "The Long Game — Principles for Sustained Flourishing"},
  {"term": "State-Nation", "definition": "Stepan's concept of a political community that accommodates multiple ethnic, linguistic, and cultural identities within a shared political framework — as opposed to a nation-state that demands cultural homogeneity.", "section": "033", "sectionName": "The Long Game — Principles for Sustained Flourishing"},
  {"term": "Adaptive Leadership", "definition": "The capacity to diagnose challenges, manage the rate of change people can absorb, and maintain forward progress without triggering backlash — essential for navigating the contradictions of long-term reform.", "section": "033", "sectionName": "The Long Game — Principles for Sustained Flourishing"}
]
